lixc929/hardware/rtthread_port/applications/ch585_spi_scan.c
/*
 * CH585M scan-frame ingest prototype for CH32H417.
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include <stddef.h>
#include <stdint.h>
#include <string.h>

#include <rtthread.h>
#include <rtdevice.h>

#include "ch32h417_dma.h"
#include "ch32h417_gpio.h"
#include "ch32h417_rcc.h"
#include "ch32h417_spi.h"
#include "ch32h417_tim.h"

#include "ch585_spi_scan.h"

extern uint32_t SystemCoreClock;
extern uint32_t HCLKClock;

#ifndef APP_CH585_SPI_REAL_SOURCE0
#define APP_CH585_SPI_REAL_SOURCE0 1
#endif

#ifndef APP_CH585_SPI_FAKE_SOURCE1
#define APP_CH585_SPI_FAKE_SOURCE1 1
#endif

#ifndef APP_CH585_SPI_SOFT_DELAY_CYCLES
#define APP_CH585_SPI_SOFT_DELAY_CYCLES 300U
#endif

#ifndef APP_CH585_SPI_SAMPLE_TRAILING
#define APP_CH585_SPI_SAMPLE_TRAILING 0
#endif

#ifndef APP_CH585_SPI_CS_SETUP_MS
#define APP_CH585_SPI_CS_SETUP_MS 1U
#endif

#ifndef APP_CH585_SPI_CMD_TO_DATA_MS
#define APP_CH585_SPI_CMD_TO_DATA_MS 0U
#endif

#ifndef APP_CH585_SPI_CMD_TO_DATA_US
#define APP_CH585_SPI_CMD_TO_DATA_US 1000U
#endif

#ifndef APP_CH585_SPI_RESYNC_TO_CMD_US
#define APP_CH585_SPI_RESYNC_TO_CMD_US 1000U
#endif

#ifndef APP_CH585_SPI_RESYNC_EVERY_POLL
#define APP_CH585_SPI_RESYNC_EVERY_POLL 0
#endif

#ifndef APP_CH585_SPI_PIPELINE_SHORT
#define APP_CH585_SPI_PIPELINE_SHORT 0
#endif

#ifndef APP_CH585_SPI_REQUEST_ONLY_SHORT
#define APP_CH585_SPI_REQUEST_ONLY_SHORT 0
#endif

#ifndef APP_CH585_SPI_DMA_BACKEND
#define APP_CH585_SPI_DMA_BACKEND 1
#endif

#ifndef APP_CH585_SPI_HW_SPI2_BACKEND
#define APP_CH585_SPI_HW_SPI2_BACKEND 1
#endif

#ifndef APP_CH585_SPI_HW_SPI2_PRESCALER
#define APP_CH585_SPI_HW_SPI2_PRESCALER SPI_BaudRatePrescaler_Mode4
#endif

#ifndef APP_CH585_SPI_HW_SPI2_HIGHSPEED
#define APP_CH585_SPI_HW_SPI2_HIGHSPEED 0
#endif

#ifndef APP_CH585_SPI_AUTO_TRAIN
#define APP_CH585_SPI_AUTO_TRAIN 1
#endif

#ifndef APP_CH585_SPI_AUTO_TRAIN_ON_INIT
#define APP_CH585_SPI_AUTO_TRAIN_ON_INIT 0
#endif

#ifndef APP_CH585_SPI_AUTO_TRAIN_AFTER_POLLS
#define APP_CH585_SPI_AUTO_TRAIN_AFTER_POLLS 8U
#endif

#ifndef APP_CH585_SPI_TRAIN_FRAMES
#define APP_CH585_SPI_TRAIN_FRAMES 64U
#endif

#ifndef APP_CH585_SPI_TRAIN_WARMUP_FRAMES
#define APP_CH585_SPI_TRAIN_WARMUP_FRAMES 8U
#endif

#ifndef APP_CH585_SPI_TRAIN_INTERFRAME_US
#define APP_CH585_SPI_TRAIN_INTERFRAME_US 125U
#endif

#ifndef APP_CH585_SPI_TRAIN_MAX_CANDIDATES
#define APP_CH585_SPI_TRAIN_MAX_CANDIDATES 16U
#endif

#ifndef APP_CH585_SPI_HW_SPI2_ENABLE_HSLV
#define APP_CH585_SPI_HW_SPI2_ENABLE_HSLV 1
#endif

#ifndef APP_CH585_SPI_HW_SPI2_GPIO_CS
#define APP_CH585_SPI_HW_SPI2_GPIO_CS 1
#endif

#ifndef APP_CH585_SPI_DMA_TARGET_KHZ
#define APP_CH585_SPI_DMA_TARGET_KHZ 70000U
#endif

#ifndef APP_CH585_SPI_SOURCE0_CAPTURE_BYTES
#define APP_CH585_SPI_SOURCE0_CAPTURE_BYTES sizeof(ch585_scan_frame_v1_t)
#endif

#ifndef APP_CH585_SPI_PIN_SCK
#define APP_CH585_SPI_PIN_SCK  "PD.2"
#endif

#ifndef APP_CH585_SPI_PIN_MOSI
#define APP_CH585_SPI_PIN_MOSI "PD.3"
#endif

#ifndef APP_CH585_SPI_PIN_MISO0
#define APP_CH585_SPI_PIN_MISO0 "PD.4"
#endif

#ifndef APP_CH585_SPI_PIN_CS0
#define APP_CH585_SPI_PIN_CS0 "PD.6"
#endif

#define CH585_SPI_DMA_PHASES_PER_BIT 2U
#define CH585_SPI_DMA_SAMPLE_PHASE   0U
#define CH585_SPI_DMA_PHASE_COUNT \
    ((uint32_t)APP_CH585_SPI_SOURCE0_CAPTURE_BYTES * 8U * CH585_SPI_DMA_PHASES_PER_BIT)
#define CH585_SPI_DMA_TIM8_UP_REQ    36U

#define CH585_SPI_BACKEND_CPU_GPIO       0U
#define CH585_SPI_BACKEND_DMA_GPIO       1U
#define CH585_SPI_BACKEND_HW_SPI2_HARDNSS 2U

#define CH585_SPI2_TX_DMA_REQ 65U
#define CH585_SPI2_RX_DMA_REQ 66U

#ifndef APP_CH585_SPI_DMA_USE_OUTDR
#define APP_CH585_SPI_DMA_USE_OUTDR 1
#endif

#ifndef APP_CH585_SPI_SHORT_DIAG_IN_DOWN_BITS
#define APP_CH585_SPI_SHORT_DIAG_IN_DOWN_BITS 1
#endif

#define CH585_SHORT_DIAG_VALID_FLAG     (1U << 7)
#define CH585_SHORT_DIAG_CMD_ERROR_FLAG (1U << 6)
#define CH585_SHORT_DIAG_CMD_MASK       0x0FU

typedef struct
{
    uint8_t pending;
    uint8_t cmd;
    uint8_t target_key;
    uint8_t param_id;
    uint16_t value;
    uint16_t flags;
    uint16_t aux;
} ch585_scan_pending_cmd_t;

typedef struct
{
    ch585_scan_source_stats_t source[CH585_SCAN_SOURCE_COUNT];
    uint32_t poll_count;
    uint16_t raw[CH585_SCAN_TOTAL_KEYS];
    ch585_scan_debug_status_t source0_debug;
    uint8_t source0_head[8];
    uint8_t source0_tail[8];
    uint8_t source0_req_rx[4];
    uint8_t source0_cmd_rx[4];
    uint8_t source0_miso_idle[3];
    uint8_t source0_sync_found;
    uint8_t source0_sync_bit;
    uint16_t source0_sync_byte;
    uint32_t source0_first_bit_repairs;
    uint32_t source0_first_bit_repair_crc_misses;
    uint16_t source0_first_bit_repair_rx_crc;
    uint16_t source0_first_bit_repair_expected_crc;
    uint8_t source0_bad_head[8];
    uint32_t source0_xfer_cycles;
    uint32_t source0_xfer_us;
    uint32_t source0_sck_khz_x10;
    uint32_t source0_frame_fps_x10;
    uint8_t source0_backend;
    uint8_t source0_dma_ready;
    uint16_t source0_dma_period;
    uint32_t source0_dma_runs;
    uint32_t source0_dma_timeouts;
    uint32_t source0_dma_te_flags;
    uint16_t source0_dma_sample_or;
    uint16_t source0_dma_sample_and;
    uint8_t source0_spi2_ready;
    uint8_t source0_need_resync;
    uint16_t source0_spi2_prescaler;
    uint8_t source0_spi2_hsrx;
    uint16_t source0_spi2_cpha;
    uint16_t source0_train_errors;
    uint16_t source0_train_frames;
    uint8_t source0_train_done;
    uint8_t source0_train_candidate_count;
    uint16_t source0_train_candidate_prescaler[APP_CH585_SPI_TRAIN_MAX_CANDIDATES];
    uint16_t source0_train_candidate_bad[APP_CH585_SPI_TRAIN_MAX_CANDIDATES];
    uint16_t source0_train_candidate_seq[APP_CH585_SPI_TRAIN_MAX_CANDIDATES];
    uint8_t source0_train_candidate_hsrx[APP_CH585_SPI_TRAIN_MAX_CANDIDATES];
    uint8_t source0_train_candidate_cpha[APP_CH585_SPI_TRAIN_MAX_CANDIDATES];
    uint16_t source0_host_seq;
    uint16_t source0_accept_ack_seq;
    uint16_t source0_pipeline_ack_seq;
    uint8_t source0_pipeline_primed;
    uint32_t source0_resync_runs;
    ch585_scan_pending_cmd_t source0_pending_cmd;
    uint32_t source0_cmd_queued;
    uint32_t source0_cmd_sent;
    uint32_t source0_debug_cmd_sent;
    uint32_t source0_calibrate_cmd_sent;
    uint8_t source0_last_cmd;
    uint8_t source0_last_frame_type;
    uint8_t source0_last_frame_seq;
    uint8_t source0_last_resync_reason;
    uint8_t source0_slave_diag_cmd;
    uint8_t source0_slave_diag_host_seq;
    uint8_t source0_slave_diag_valid;
    uint8_t source0_slave_diag_cmd_error;
    uint8_t source0_slave_diag_invalid_count;
    uint8_t source0_slave_diag_invalid_reason;
    uint8_t source0_slave_diag_raw_magic;
    uint8_t source0_slave_diag_raw_cmd;
    uint8_t source0_slave_diag_raw_host_seq;
    uint8_t source0_slave_diag_raw_ack_seq;
    uint16_t source0_slave_diag_rx_crc;
    uint16_t source0_slave_diag_expected_crc;
    uint32_t source0_cmd_runs;
    uint32_t source0_cmd_timeouts;
    uint32_t source0_ack_errors;
    uint32_t source0_spi2_runs;
    uint32_t source0_spi2_timeouts;
    uint32_t source0_spi2_te_flags;
    uint16_t source0_spi2_sr_last;
    rt_base_t source1_gpio_cs;
} ch585_scan_runtime_t;

typedef struct
{
    rt_base_t sck;
    rt_base_t mosi;
    rt_base_t miso0;
    rt_base_t cs0;
    uint8_t ready;
} ch585_soft_spi_t;

static ch585_scan_runtime_t g_scan;
static ch585_soft_spi_t g_soft_spi;
static uint8_t g_source0_capture[APP_CH585_SPI_SOURCE0_CAPTURE_BYTES];

#if APP_CH585_SPI_HW_SPI2_BACKEND
static uint8_t g_source0_spi2_tx[APP_CH585_SPI_SOURCE0_CAPTURE_BYTES] __attribute__((aligned(4)));
static uint8_t g_source0_spi2_rx[APP_CH585_SPI_SOURCE0_CAPTURE_BYTES] __attribute__((aligned(4)));
static ch585_scan_cmd_v1_t g_source0_spi2_cmd_tx __attribute__((aligned(4)));
static ch585_scan_cmd_v1_t g_source0_spi2_cmd_rx __attribute__((aligned(4)));
#endif

#if APP_CH585_SPI_HW_SPI2_BACKEND
static int ch585_hw_spi2_train(void);
static int ch585_scan_decode_source0_capture(ch585_scan_frame_v1_t *frame);
static int ch585_scan_frame_is_valid(const ch585_scan_frame_v1_t *frame);

