lixc929/hardware/rtthread_port/applications/ch585_spi_scan.c
static uint32_t ch585_hw_spi2_prescaler_divisor(void)
{
    uint16_t prescaler = (g_scan.source0_spi2_ready != 0U) ?
                         g_scan.source0_spi2_prescaler :
                         APP_CH585_SPI_HW_SPI2_PRESCALER;

    if (g_scan.source0_spi2_hsrx != 0U)
    {
        switch (prescaler)
        {
        case SPI_BaudRatePrescaler_Mode0: return 2U;
        case SPI_BaudRatePrescaler_Mode1: return 3U;
        case SPI_BaudRatePrescaler_Mode2: return 4U;
        case SPI_BaudRatePrescaler_Mode3: return 5U;
        case SPI_BaudRatePrescaler_Mode4: return 6U;
        case SPI_BaudRatePrescaler_Mode5: return 7U;
        case SPI_BaudRatePrescaler_Mode6: return 8U;
        case SPI_BaudRatePrescaler_Mode7: return 9U;
        default: return 4U;
        }
    }

    switch (prescaler)
    {
    case SPI_BaudRatePrescaler_Mode0: return 2U;
    case SPI_BaudRatePrescaler_Mode1: return 4U;
    case SPI_BaudRatePrescaler_Mode2: return 8U;
    case SPI_BaudRatePrescaler_Mode3: return 16U;
    case SPI_BaudRatePrescaler_Mode4: return 32U;
    case SPI_BaudRatePrescaler_Mode5: return 64U;
    case SPI_BaudRatePrescaler_Mode6: return 128U;
    case SPI_BaudRatePrescaler_Mode7: return 256U;
    default: return 8U;
    }
}

static uint32_t ch585_hw_spi2_expected_sck_khz_x10(void)
{
    uint32_t clk = (HCLKClock != 0U) ? HCLKClock : SystemCoreClock;
    uint32_t div = ch585_hw_spi2_prescaler_divisor();

    if ((clk == 0U) || (div == 0U))
    {
        return 0U;
    }

    return (uint32_t)((((uint64_t)clk * 10ULL) + ((uint64_t)div * 1000ULL / 2ULL)) /
                      ((uint64_t)div * 1000ULL));
}

static const char *ch585_scan_source0_backend_name(void)
{
    switch (g_scan.source0_backend)
    {
    case CH585_SPI_BACKEND_HW_SPI2_HARDNSS:
#if APP_CH585_SPI_HW_SPI2_GPIO_CS
        return "hw-spi2-gpiocs";
#else
        return "hw-spi2-hardnss";
#endif
    case CH585_SPI_BACKEND_DMA_GPIO:
        return "dma-gpio";
    case CH585_SPI_BACKEND_CPU_GPIO:
    default:
        return "cpu-gpio";
    }
}

static void ch585_hw_spi2_apply_config(uint16_t prescaler, uint8_t hsrx, uint16_t cpha)
{
    SPI_InitTypeDef spi = {0};

    SPI_Cmd(SPI2, DISABLE);
    SPI_I2S_DeInit(SPI2);

#if APP_CH585_SPI_HW_SPI2_GPIO_CS
    SPI_SSOutputCmd(SPI2, DISABLE);
#else
    SPI_SSOutputCmd(SPI2, ENABLE);
#endif

    spi.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
    spi.SPI_Mode = SPI_Mode_Master;
    spi.SPI_DataSize = SPI_DataSize_8b;
    spi.SPI_CPOL = SPI_CPOL_Low;
    spi.SPI_CPHA = cpha;
#if APP_CH585_SPI_HW_SPI2_GPIO_CS
    spi.SPI_NSS = SPI_NSS_Soft;
#else
    spi.SPI_NSS = SPI_NSS_Hard;
#endif
    spi.SPI_BaudRatePrescaler = prescaler;
    spi.SPI_FirstBit = SPI_FirstBit_MSB;
    spi.SPI_CRCPolynomial = 7U;
    SPI_Init(SPI2, &spi);

#if APP_CH585_SPI_HW_SPI2_GPIO_CS
    SPI_NSSInternalSoftwareConfig(SPI2, SPI_NSSInternalSoft_Set);
#endif

    if (hsrx == 1U)
    {
        SPI_HighSpeedMode_Config(SPI2, SPI_HIGH_SPEED_MODE1, ENABLE);
    }
    else if (hsrx == 2U)
    {
        SPI_HighSpeedMode_Config(SPI2, SPI_HIGH_SPEED_MODE2, ENABLE);
    }
    else
    {
        SPI_HighSpeedMode_Config(SPI2, SPI_HIGH_SPEED_MODE1, DISABLE);
    }

    SPI_Cmd(SPI2, DISABLE);
    g_scan.source0_spi2_prescaler = prescaler;
    g_scan.source0_spi2_hsrx = hsrx;
    g_scan.source0_spi2_cpha = cpha;
}

static int ch585_hw_spi2_init(void)
{
    GPIO_InitTypeDef gpio = {0};

    RCC_HB2PeriphClockCmd(RCC_HB2Periph_AFIO |
                          RCC_HB2Periph_GPIOB |
                          RCC_HB2Periph_GPIOC |
                          RCC_HB2Periph_GPIOD, ENABLE);
    RCC_HB1PeriphClockCmd(RCC_HB1Periph_SPI2, ENABLE);
    RCC_HBPeriphClockCmd(RCC_HBPeriph_DMA1, ENABLE);

#if APP_CH585_SPI_HW_SPI2_ENABLE_HSLV
    GPIO_PinRemapConfig(GPIO_Remap_VIO3V3_IO_HSLV, ENABLE);
    GPIO_PinRemapConfig(GPIO_Remap_VDD3V3_IO_HSLV, ENABLE);
#endif

#if APP_CH585_SPI_HW_SPI2_GPIO_CS
    /* SPI2 uses hardware SCK/MOSI/MISO; PB12 is a manual GPIO CS for CH585 #0. */
    GPIO_SetBits(GPIOB, GPIO_Pin_12);
    gpio.GPIO_Pin = GPIO_Pin_12;
    gpio.GPIO_Speed = GPIO_Speed_Very_High;
    gpio.GPIO_Mode = GPIO_Mode_Out_PP;
    GPIO_Init(GPIOB, &gpio);
#else
    /* Method 2: SPI2 hardware NSS selects CH585 #0, PD7 is reserved for CH585 #1. */
    GPIO_PinAFConfig(GPIOB, GPIO_PinSource12, GPIO_AF5);
    gpio.GPIO_Pin = GPIO_Pin_12;
    gpio.GPIO_Speed = GPIO_Speed_Very_High;
    gpio.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_Init(GPIOB, &gpio);
#endif

    GPIO_PinAFConfig(GPIOB, GPIO_PinSource13, GPIO_AF5);
    gpio.GPIO_Pin = GPIO_Pin_13;
    gpio.GPIO_Speed = GPIO_Speed_Very_High;
    gpio.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_Init(GPIOB, &gpio);

    GPIO_PinAFConfig(GPIOC, GPIO_PinSource1, GPIO_AF5);
    gpio.GPIO_Pin = GPIO_Pin_1;
    gpio.GPIO_Speed = GPIO_Speed_Very_High;
    gpio.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_Init(GPIOC, &gpio);

    GPIO_PinAFConfig(GPIOC, GPIO_PinSource2, GPIO_AF5);
    gpio.GPIO_Pin = GPIO_Pin_2;
    gpio.GPIO_Speed = GPIO_Speed_Very_High;
    gpio.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    GPIO_Init(GPIOC, &gpio);

    gpio.GPIO_Pin = GPIO_Pin_7;
    gpio.GPIO_Speed = GPIO_Speed_Very_High;
    gpio.GPIO_Mode = GPIO_Mode_Out_PP;
    GPIO_Init(GPIOD, &gpio);
    GPIOD->BSHR = GPIO_Pin_7;
    g_scan.source1_gpio_cs = rt_pin_get("PD.7");

    ch585_hw_spi2_apply_config(APP_CH585_SPI_HW_SPI2_PRESCALER,
                               APP_CH585_SPI_HW_SPI2_HIGHSPEED,
                               SPI_CPHA_1Edge);
    g_scan.source0_spi2_ready = 1U;

#if APP_CH585_SPI_AUTO_TRAIN && APP_CH585_SPI_AUTO_TRAIN_ON_INIT
    (void)ch585_hw_spi2_train();
#endif

    rt_kprintf("CH585 source0 HW SPI2 method2: PB12=%s PB13=SCK PC1=MOSI PC2=MISO, CS1=PD7, prescaler=0x%04x hsrx=%u cpha=%u expect=%u.%u kHz hclk=%u core=%u hslv=%u\r\n",
#if APP_CH585_SPI_HW_SPI2_GPIO_CS
               "GPIO-CS",
#else
               "NSS",
#endif
               (unsigned int)g_scan.source0_spi2_prescaler,
               (unsigned int)g_scan.source0_spi2_hsrx,
               (unsigned int)((g_scan.source0_spi2_cpha == SPI_CPHA_2Edge) ? 2U : 1U),
               (unsigned int)(ch585_hw_spi2_expected_sck_khz_x10() / 10U),
               (unsigned int)(ch585_hw_spi2_expected_sck_khz_x10() % 10U),
               (unsigned int)HCLKClock,
               (unsigned int)SystemCoreClock,
               (unsigned int)APP_CH585_SPI_HW_SPI2_ENABLE_HSLV);
    return 0;
}
#else
static const char *ch585_scan_source0_backend_name(void)
{
    return (g_scan.source0_backend != 0U) ? "dma-gpio" : "cpu-gpio";
}
#endif

#if APP_CH585_SPI_DMA_BACKEND
#if APP_CH585_SPI_DMA_USE_OUTDR
static uint16_t g_source0_dma_sck_wave[CH585_SPI_DMA_PHASE_COUNT] __attribute__((aligned(4)));
#else
static uint32_t g_source0_dma_sck_wave[CH585_SPI_DMA_PHASE_COUNT] __attribute__((aligned(4)));
#endif
static uint16_t g_source0_dma_miso_sample[CH585_SPI_DMA_PHASE_COUNT] __attribute__((aligned(4)));
#endif

