lixc929/hardware/rtthread_port/applications/ch585_spi_scan.c
static uint16_t g_fake_seq[CH585_SCAN_SOURCE_COUNT];

static uint32_t ch585_cycle_now(void)
{
    uint32_t value;

    __asm volatile ("csrr %0, mcycle" : "=r"(value));
    return value;
}

static void ch585_cycle_delay_us(uint32_t us)
{
    uint32_t cycles;
    uint32_t start;

    if ((us == 0U) || (SystemCoreClock == 0U))
    {
        return;
    }

    cycles = (uint32_t)((((uint64_t)SystemCoreClock * (uint64_t)us) +
                         999999ULL) / 1000000ULL);
    start = ch585_cycle_now();
    while ((uint32_t)(ch585_cycle_now() - start) < cycles)
    {
    }
}

uint16_t ch585_spi_scan_crc16(const uint8_t *data, uint16_t len)
{
    uint16_t crc = 0xFFFFU;
    uint16_t i;
    uint8_t bit;

    for (i = 0; i < len; i++)
    {
        crc ^= (uint16_t)data[i] << 8;
        for (bit = 0; bit < 8; bit++)
        {
            if ((crc & 0x8000U) != 0U)
            {
                crc = (uint16_t)((crc << 1) ^ 0x1021U);
            }
            else
            {
                crc = (uint16_t)(crc << 1);
            }
        }
    }

    return crc;
}

static uint16_t ch585_scan_expected_base(uint8_t source_id)
{
    return (uint16_t)source_id * CH585_SCAN_KEYS_PER_SOURCE;
}

static void ch585_scan_frame_set_down_bit(ch585_scan_frame_v1_t *frame, uint8_t key_id)
{
    frame->down_bits[key_id >> 3] |= (uint8_t)(1U << (key_id & 7U));
}

#if APP_CH585_SPI_WIRE_SHORT
static uint8_t ch585_scan_flags_to_short(uint16_t flags)
{
    uint8_t out = 0U;

    if ((flags & CH585_SCAN_FLAG_OVERRUN) != 0U)
    {
        out |= CH585_SCAN_SHORT_FLAG_OVERRUN;
    }
    if ((flags & CH585_SCAN_FLAG_ADC_ERROR) != 0U)
    {
        out |= CH585_SCAN_SHORT_FLAG_ADC_ERROR;
    }
    if ((flags & CH585_SCAN_FLAG_STALE) != 0U)
    {
        out |= CH585_SCAN_SHORT_FLAG_STALE;
    }
    if ((flags & CH585_SCAN_FLAG_SYNC_LOST) != 0U)
    {
        out |= CH585_SCAN_SHORT_FLAG_SYNC_LOST;
    }
    if ((flags & CH585_SCAN_FLAG_CMD_ERROR) != 0U)
    {
        out |= CH585_SCAN_SHORT_FLAG_CMD_ERROR;
    }
    if ((flags & CH585_SCAN_FLAG_READY) != 0U)
    {
        out |= CH585_SCAN_SHORT_FLAG_READY;
    }

    return out;
}

static uint16_t ch585_scan_flags_from_short(uint8_t flags)
{
    uint16_t out = 0U;

    if ((flags & CH585_SCAN_SHORT_FLAG_OVERRUN) != 0U)
    {
        out |= CH585_SCAN_FLAG_OVERRUN;
    }
    if ((flags & CH585_SCAN_SHORT_FLAG_ADC_ERROR) != 0U)
    {
        out |= CH585_SCAN_FLAG_ADC_ERROR;
    }
    if ((flags & CH585_SCAN_SHORT_FLAG_STALE) != 0U)
    {
        out |= CH585_SCAN_FLAG_STALE;
    }
    if ((flags & CH585_SCAN_SHORT_FLAG_SYNC_LOST) != 0U)
    {
        out |= CH585_SCAN_FLAG_SYNC_LOST;
    }
    if ((flags & CH585_SCAN_SHORT_FLAG_CMD_ERROR) != 0U)
    {
        out |= CH585_SCAN_FLAG_CMD_ERROR;
    }
    if ((flags & CH585_SCAN_SHORT_FLAG_READY) != 0U)
    {
        out |= CH585_SCAN_FLAG_READY;
    }

    return out;
}

static int ch585_scan_short_type_is_supported(uint8_t type)
{
    return ((type == CH585_SCAN_SHORT_FRAME_TYPE_KEY_STATE) ||
            (type == CH585_SCAN_SHORT_FRAME_TYPE_KEY_DEBUG)) ? 1 : 0;
}

static uint16_t ch585_scan_debug_flags_for_stats(uint8_t flags)
{
    uint16_t out = 0U;

    if ((flags & CH585_SCAN_SHORT_FLAG_READY) != 0U)
    {
        out |= CH585_SCAN_FLAG_READY;
    }

    return out;
}
#endif

static int ch585_scan_param_id_is_valid(uint8_t param_id)
{
    return ((param_id >= CH585_SCAN_CFG_RELEASED_ADC) &&
            (param_id <= CH585_SCAN_CFG_GLOBAL_KEY_ID)) ? 1 : 0;
}

static int ch585_scan_queue_source0_cmd(uint8_t cmd,
                                        uint8_t key_id,
                                        uint8_t param_id,
                                        uint16_t value,
                                        uint16_t flags,
                                        uint16_t aux)
{
    ch585_scan_pending_cmd_t *pending = &g_scan.source0_pending_cmd;

    if (key_id >= CH585_SCAN_KEYS_PER_SOURCE)
    {
        return -1;
    }

    if (((cmd == CH585_SCAN_CMD_GET_CONFIG) ||
         (cmd == CH585_SCAN_CMD_SET_CONFIG)) &&
        (ch585_scan_param_id_is_valid(param_id) == 0))
    {
        return -1;
    }

    if (pending->pending != 0U)
    {
        return -2;
    }

    pending->cmd = cmd;
    pending->target_key = key_id;
    pending->param_id = param_id;
    pending->value = value;
    pending->flags = flags;
    pending->aux = aux;
    pending->pending = 1U;
    g_scan.source0_cmd_queued++;

    return 0;
}

int ch585_spi_scan_source0_queue_get_debug(uint8_t key_id)
{
    return ch585_scan_queue_source0_cmd(CH585_SCAN_CMD_GET_DEBUG,
                                        key_id,
                                        0U,
                                        0U,
                                        0U,
                                        0U);
}

int ch585_spi_scan_source0_queue_get_config(uint8_t key_id, uint8_t param_id)
{
    return ch585_scan_queue_source0_cmd(CH585_SCAN_CMD_GET_CONFIG,
                                        key_id,
                                        param_id,
                                        0U,
                                        0U,
                                        0U);
}

int ch585_spi_scan_source0_queue_set_config(uint8_t key_id, uint8_t param_id, uint16_t value)
{
    return ch585_scan_queue_source0_cmd(CH585_SCAN_CMD_SET_CONFIG,
                                        key_id,
                                        param_id,
                                        value,
                                        0U,
                                        0U);
}

int ch585_spi_scan_source0_queue_calibrate_key(uint8_t key_id, uint16_t flags)
{
    return ch585_scan_queue_source0_cmd(CH585_SCAN_CMD_CALIBRATE_KEY,
                                        key_id,
                                        0U,
                                        0U,
                                        flags,
                                        0U);
}

static int ch585_scan_fetch_source(uint8_t source_id, ch585_scan_frame_v1_t *frame)
{
    uint8_t i;
    uint16_t seq;
    uint16_t phase;

    if ((source_id >= CH585_SCAN_SOURCE_COUNT) || (frame == RT_NULL))
    {
        return -1;
    }

    seq = g_fake_seq[source_id]++;
    memset(frame, 0, sizeof(*frame));

#if APP_CH585_SPI_WIRE_SHORT
    frame->magic = CH585_SCAN_SHORT_FRAME_MAGIC;
    frame->type = CH585_SCAN_SHORT_FRAME_TYPE_KEY_STATE;
    frame->source_id = source_id;
    frame->seq = (uint8_t)seq;
    frame->ack_seq = 0xFFU;
    frame->flags = ch585_scan_flags_to_short(CH585_SCAN_FLAG_READY);
#else
    frame->magic = CH585_SCAN_FRAME_MAGIC;
    frame->version = CH585_SCAN_FRAME_VERSION;
    frame->type = CH585_SCAN_FRAME_TYPE_KEY_STATE;
    frame->source_id = source_id;
    frame->key_count = CH585_SCAN_KEYS_PER_SOURCE;
    frame->seq = seq;
    frame->flags = CH585_SCAN_FLAG_READY;
    frame->ack_seq = 0xFFFFU;
    frame->diag = 0U;
#endif

    for (i = 0; i < CH585_SCAN_KEYS_PER_SOURCE; i++)
    {
        phase = (uint16_t)((seq + ((uint16_t)i * 4U) + ((uint16_t)source_id * 8U)) & 31U);
        if ((i < 4U) && (phase >= 8U) && (phase < 24U))
        {
            ch585_scan_frame_set_down_bit(frame, i);
        }
    }

    frame->crc16 = ch585_spi_scan_crc16((const uint8_t *)frame,
                                        (uint16_t)offsetof(ch585_scan_frame_v1_t, crc16));
    return 0;
}

static void ch585_soft_spi_delay(void)
{
    volatile uint32_t i;

    for (i = 0; i < APP_CH585_SPI_SOFT_DELAY_CYCLES; i++)
    {
        __asm volatile ("nop");
    }
}

