lixc929/hardware/rtthread_port/applications/ch585_spi_scan.c
static int ch585_soft_spi_init(void)
{
    g_soft_spi.sck = rt_pin_get(APP_CH585_SPI_PIN_SCK);
    g_soft_spi.mosi = rt_pin_get(APP_CH585_SPI_PIN_MOSI);
    g_soft_spi.miso0 = rt_pin_get(APP_CH585_SPI_PIN_MISO0);
    g_soft_spi.cs0 = rt_pin_get(APP_CH585_SPI_PIN_CS0);

    if ((g_soft_spi.sck < 0) || (g_soft_spi.mosi < 0) ||
        (g_soft_spi.miso0 < 0) || (g_soft_spi.cs0 < 0))
    {
        rt_kprintf("CH585 soft SPI pin lookup failed: sck=%d mosi=%d miso0=%d cs0=%d\r\n",
                   (int)g_soft_spi.sck, (int)g_soft_spi.mosi,
                   (int)g_soft_spi.miso0, (int)g_soft_spi.cs0);
        return -1;
    }

    rt_pin_mode(g_soft_spi.sck, PIN_MODE_OUTPUT);
    rt_pin_mode(g_soft_spi.mosi, PIN_MODE_OUTPUT);
    rt_pin_mode(g_soft_spi.cs0, PIN_MODE_OUTPUT);
    rt_pin_mode(g_soft_spi.miso0, PIN_MODE_INPUT_PULLUP);

    rt_pin_write(g_soft_spi.cs0, PIN_HIGH);
    rt_pin_write(g_soft_spi.sck, PIN_LOW);
    rt_pin_write(g_soft_spi.mosi, PIN_HIGH);

    g_soft_spi.ready = 1U;
    rt_kprintf("CH585 soft SPI source0 pins: SCK=%s MOSI=%s MISO=%s CS=%s, idle-low sample=%s MSB-first\r\n",
               APP_CH585_SPI_PIN_SCK, APP_CH585_SPI_PIN_MOSI,
               APP_CH585_SPI_PIN_MISO0, APP_CH585_SPI_PIN_CS0,
#if APP_CH585_SPI_SAMPLE_TRAILING
               "trailing"
#else
               "leading"
#endif
    );
    return 0;
}

#if APP_CH585_SPI_DMA_BACKEND
static uint16_t ch585_dma_period_from_target(void)
{
    uint32_t denom;
    uint32_t ticks;
    uint32_t tim_clk;

    denom = APP_CH585_SPI_DMA_TARGET_KHZ * 1000U * CH585_SPI_DMA_PHASES_PER_BIT;
    tim_clk = (HCLKClock != 0U) ? HCLKClock : SystemCoreClock;
    if ((tim_clk == 0U) || (denom == 0U))
    {
        return 356U;
    }

    ticks = (uint32_t)((((uint64_t)tim_clk) + ((uint64_t)denom / 2ULL)) /
                       (uint64_t)denom);
    if (ticks < 2U)
    {
        ticks = 2U;
    }
    if (ticks > 65535U)
    {
        ticks = 65535U;
    }

    return (uint16_t)(ticks - 1U);
}

static void ch585_dma_wave_prepare(void)
{
    uint32_t bit;
    uint32_t phase;

#if APP_CH585_SPI_DMA_USE_OUTDR
    uint16_t base;
    uint16_t sck_high;

    base = (uint16_t)GPIOD->OUTDR;
    base |= GPIO_Pin_3;
    base &= (uint16_t)~(GPIO_Pin_2 | GPIO_Pin_6);
    sck_high = (uint16_t)(base | GPIO_Pin_2);

    for (bit = 0U; bit < ((uint32_t)APP_CH585_SPI_SOURCE0_CAPTURE_BYTES * 8U); bit++)
    {
        phase = bit * CH585_SPI_DMA_PHASES_PER_BIT;
#if CH585_SPI_DMA_PHASES_PER_BIT == 4U
        g_source0_dma_sck_wave[phase + 0U] = base;
        g_source0_dma_sck_wave[phase + 1U] = sck_high;
        g_source0_dma_sck_wave[phase + 2U] = sck_high;
        g_source0_dma_sck_wave[phase + 3U] = base;
#elif CH585_SPI_DMA_PHASES_PER_BIT == 3U
        g_source0_dma_sck_wave[phase + 0U] = sck_high;
        g_source0_dma_sck_wave[phase + 1U] = sck_high;
        g_source0_dma_sck_wave[phase + 2U] = base;
#elif CH585_SPI_DMA_PHASES_PER_BIT == 2U
        g_source0_dma_sck_wave[phase + 0U] = sck_high;
        g_source0_dma_sck_wave[phase + 1U] = base;
#else
#error "Unsupported CH585_SPI_DMA_PHASES_PER_BIT"
#endif
    }
#else
    for (bit = 0U; bit < ((uint32_t)APP_CH585_SPI_SOURCE0_CAPTURE_BYTES * 8U); bit++)
    {
        phase = bit * CH585_SPI_DMA_PHASES_PER_BIT;
#if CH585_SPI_DMA_PHASES_PER_BIT == 4U
        g_source0_dma_sck_wave[phase + 0U] = GPIO_BSHR_BR2;
        g_source0_dma_sck_wave[phase + 1U] = GPIO_BSHR_BS2;
        g_source0_dma_sck_wave[phase + 2U] = 0U;
        g_source0_dma_sck_wave[phase + 3U] = GPIO_BSHR_BR2;
#elif CH585_SPI_DMA_PHASES_PER_BIT == 3U
        g_source0_dma_sck_wave[phase + 0U] = GPIO_BSHR_BS2;
        g_source0_dma_sck_wave[phase + 1U] = 0U;
        g_source0_dma_sck_wave[phase + 2U] = GPIO_BSHR_BR2;
#elif CH585_SPI_DMA_PHASES_PER_BIT == 2U
        g_source0_dma_sck_wave[phase + 0U] = GPIO_BSHR_BS2;
        g_source0_dma_sck_wave[phase + 1U] = GPIO_BSHR_BR2;
#else
#error "Unsupported CH585_SPI_DMA_PHASES_PER_BIT"
#endif
    }
#endif
}

static int ch585_dma_soft_spi_init(void)
{
    TIM_TimeBaseInitTypeDef timer = {0};

    RCC_HB2PeriphClockCmd(RCC_HB2Periph_GPIOD | RCC_HB2Periph_TIM8 | RCC_HB2Periph_AFIO, ENABLE);
    RCC_HBPeriphClockCmd(RCC_HBPeriph_DMA1, ENABLE);

    ch585_dma_wave_prepare();
    g_scan.source0_dma_period = ch585_dma_period_from_target();

    TIM_Cmd(TIM8, DISABLE);
    TIM_DeInit(TIM8);
    timer.TIM_ClockDivision = TIM_CKD_DIV1;
    timer.TIM_CounterMode = TIM_CounterMode_Up;
    timer.TIM_Period = g_scan.source0_dma_period;
    timer.TIM_Prescaler = 0U;
    timer.TIM_RepetitionCounter = 0U;
    TIM_TimeBaseInit(TIM8, &timer);
    TIM_DMACmd(TIM8, TIM_DMA_Update, ENABLE);

    DMA_MuxChannelConfig(DMA_MuxChannel1, CH585_SPI_DMA_TIM8_UP_REQ);
    DMA_MuxChannelConfig(DMA_MuxChannel2, CH585_SPI_DMA_TIM8_UP_REQ);

    GPIOD->BSHR = GPIO_BSHR_BR2;
    g_scan.source0_dma_ready = 1U;

    rt_kprintf("CH585 source0 DMA soft SPI: TIM8_UP req=%u phase_count=%u target=%u kHz period=%u sample_phase=%u hclk=%u core=%u\r\n",
               (unsigned int)CH585_SPI_DMA_TIM8_UP_REQ,
               (unsigned int)CH585_SPI_DMA_PHASE_COUNT,
               (unsigned int)APP_CH585_SPI_DMA_TARGET_KHZ,
               (unsigned int)g_scan.source0_dma_period,
               (unsigned int)CH585_SPI_DMA_SAMPLE_PHASE,
               (unsigned int)HCLKClock,
               (unsigned int)SystemCoreClock);
    return 0;
}
#endif

static uint8_t ch585_soft_spi_transfer_byte(uint8_t tx)
{
    uint8_t bit;
    uint8_t rx = 0U;

    for (bit = 0x80U; bit != 0U; bit >>= 1)
    {
        rt_pin_write(g_soft_spi.mosi, ((tx & bit) != 0U) ? PIN_HIGH : PIN_LOW);
        ch585_soft_spi_delay();

        rt_pin_write(g_soft_spi.sck, PIN_HIGH);
        ch585_soft_spi_delay();

#if APP_CH585_SPI_SAMPLE_TRAILING
        rt_pin_write(g_soft_spi.sck, PIN_LOW);
        ch585_soft_spi_delay();

        if (rt_pin_read(g_soft_spi.miso0) == PIN_HIGH)
        {
            rx |= bit;
        }
#else
        if (rt_pin_read(g_soft_spi.miso0) == PIN_HIGH)
        {
            rx |= bit;
        }

        rt_pin_write(g_soft_spi.sck, PIN_LOW);
        ch585_soft_spi_delay();
#endif
    }

    return rx;
}

