lixc929/hardware/rtthread_port/applications/ch585_spi_scan.c
static uint8_t ch585_bitstream_read_byte(const uint8_t *stream, uint32_t bit_start)
{
    uint8_t value = 0U;
    uint8_t i;

    for (i = 0; i < 8U; i++)
    {
        uint32_t bit_index = bit_start + i;
        uint8_t bit = (uint8_t)((stream[bit_index >> 3] >> (7U - (bit_index & 7U))) & 1U);
        value = (uint8_t)((value << 1) | bit);
    }

    return value;
}

static int ch585_scan_frame_is_valid(const ch585_scan_frame_v1_t *frame)
{
    uint16_t expected_crc;

    if (frame == RT_NULL)
    {
        return 0;
    }

#if APP_CH585_SPI_WIRE_SHORT
    if ((frame->magic != CH585_SCAN_SHORT_FRAME_MAGIC) ||
        (ch585_scan_short_type_is_supported(frame->type) == 0) ||
        (frame->source_id != 0U))
    {
        return 0;
    }
#else
    if ((frame->magic != CH585_SCAN_FRAME_MAGIC) ||
        (frame->version != CH585_SCAN_FRAME_VERSION) ||
        (frame->type != CH585_SCAN_FRAME_TYPE_KEY_STATE) ||
        (frame->source_id != 0U) ||
        (frame->key_count != CH585_SCAN_KEYS_PER_SOURCE))
    {
        return 0;
    }
#endif

    expected_crc = ch585_spi_scan_crc16((const uint8_t *)frame,
                                        (uint16_t)offsetof(ch585_scan_frame_v1_t, crc16));
    return (frame->crc16 == expected_crc) ? 1 : 0;
}

static int ch585_scan_find_frame_in_stream(const uint8_t *stream,
                                           uint16_t stream_len,
                                           ch585_scan_frame_v1_t *frame,
                                           uint16_t *byte_offset,
                                           uint8_t *bit_offset)
{
    ch585_scan_frame_v1_t candidate;
    uint8_t *candidate_bytes = (uint8_t *)&candidate;
    uint32_t total_bits;
    uint32_t frame_bits;
    uint32_t bit_start;
    uint16_t i;

    if ((stream == RT_NULL) || (frame == RT_NULL))
    {
        return -1;
    }

    total_bits = (uint32_t)stream_len * 8U;
    frame_bits = (uint32_t)sizeof(candidate) * 8U;
    if (total_bits < frame_bits)
    {
        return -1;
    }

    for (bit_start = 0U; bit_start + frame_bits <= total_bits; bit_start++)
    {
#if APP_CH585_SPI_WIRE_SHORT
        if ((ch585_bitstream_read_byte(stream, bit_start) !=
             (uint8_t)CH585_SCAN_SHORT_FRAME_MAGIC) ||
            (ch585_scan_short_type_is_supported(
                 ch585_bitstream_read_byte(stream, bit_start + 8U)) == 0))
        {
            continue;
        }
#else
        if ((ch585_bitstream_read_byte(stream, bit_start) !=
             (uint8_t)(CH585_SCAN_FRAME_MAGIC & 0xFFU)) ||
            (ch585_bitstream_read_byte(stream, bit_start + 8U) !=
             (uint8_t)((CH585_SCAN_FRAME_MAGIC >> 8) & 0xFFU)))
        {
            continue;
        }
#endif

        for (i = 0U; i < sizeof(candidate); i++)
        {
            candidate_bytes[i] = ch585_bitstream_read_byte(stream, bit_start + ((uint32_t)i * 8U));
        }

        if (ch585_scan_frame_is_valid(&candidate) != 0)
        {
            memcpy(frame, &candidate, sizeof(*frame));
            if (byte_offset != RT_NULL)
            {
                *byte_offset = (uint16_t)(bit_start >> 3);
            }
            if (bit_offset != RT_NULL)
            {
                *bit_offset = (uint8_t)(bit_start & 7U);
            }
            return 0;
        }
    }

    return -1;
}

static int ch585_scan_try_first_bit_repair(const uint8_t *stream, ch585_scan_frame_v1_t *frame)
{
    uint8_t *frame_bytes = (uint8_t *)frame;
    uint16_t expected_crc;

    if ((stream == RT_NULL) || (frame == RT_NULL))
    {
        return -1;
    }

    memcpy(frame, stream, sizeof(*frame));

    if (ch585_scan_frame_is_valid(frame) != 0)
    {
        return 0;
    }

    /*
     * CH585 SPI0 can leave MISO high until the first clock after CS, so the
     * first sampled bit may be 1 while the rest of the frame is byte-aligned.
     * Keep this path for older low-MSB magic bytes; the current magic starts
     * with 0xd3 so a healthy frame should validate before reaching here.
     */
#if APP_CH585_SPI_WIRE_SHORT
    if (((frame_bytes[0] & 0x7FU) ==
         ((uint8_t)CH585_SCAN_SHORT_FRAME_MAGIC & 0x7FU)) &&
        (ch585_scan_short_type_is_supported(frame_bytes[1]) != 0))
    {
        frame_bytes[0] = (uint8_t)CH585_SCAN_SHORT_FRAME_MAGIC;
        g_scan.source0_first_bit_repair_rx_crc = frame->crc16;
        expected_crc = ch585_spi_scan_crc16((const uint8_t *)frame,
                                            (uint16_t)offsetof(ch585_scan_frame_v1_t, crc16));
        g_scan.source0_first_bit_repair_expected_crc = expected_crc;
        if ((ch585_scan_short_type_is_supported(frame->type) != 0) &&
            (frame->source_id == 0U) &&
            (frame->crc16 == expected_crc))
        {
            g_scan.source0_first_bit_repairs++;
            g_scan.source0_sync_found = 2U;
            return 0;
        }
        g_scan.source0_first_bit_repair_crc_misses++;
    }
#else
    if (((frame_bytes[0] & 0x7FU) ==
         ((uint8_t)(CH585_SCAN_FRAME_MAGIC & 0xFFU) & 0x7FU)) &&
        (frame_bytes[1] == (uint8_t)((CH585_SCAN_FRAME_MAGIC >> 8) & 0xFFU)))
    {
        frame_bytes[0] = (uint8_t)(CH585_SCAN_FRAME_MAGIC & 0xFFU);
        g_scan.source0_first_bit_repair_rx_crc = frame->crc16;
        expected_crc = ch585_spi_scan_crc16((const uint8_t *)frame,
                                            (uint16_t)offsetof(ch585_scan_frame_v1_t, crc16));
        g_scan.source0_first_bit_repair_expected_crc = expected_crc;
        if ((frame->version == CH585_SCAN_FRAME_VERSION) &&
            (frame->type == CH585_SCAN_FRAME_TYPE_KEY_STATE) &&
            (frame->source_id == 0U) &&
            (frame->key_count == CH585_SCAN_KEYS_PER_SOURCE) &&
            (frame->crc16 == expected_crc))
        {
            g_scan.source0_first_bit_repairs++;
            g_scan.source0_sync_found = 2U;
            return 0;
        }
        g_scan.source0_first_bit_repair_crc_misses++;
    }
#endif

    return -1;
}

static void ch585_scan_snapshot_source0_capture(void)
{
    uint16_t i;

    for (i = 0U; i < sizeof(g_scan.source0_head); i++)
    {
        g_scan.source0_head[i] = g_source0_capture[i];
    }
    for (i = 0U; i < sizeof(g_scan.source0_req_rx); i++)
    {
        g_scan.source0_req_rx[i] = g_source0_capture[i];
    }
    for (i = 0U; i < sizeof(g_scan.source0_tail); i++)
    {
        g_scan.source0_tail[i] =
            g_source0_capture[sizeof(ch585_scan_frame_v1_t) - sizeof(g_scan.source0_tail) + i];
    }
}

static int ch585_scan_decode_source0_capture(ch585_scan_frame_v1_t *frame)
{
    uint8_t *rx = (uint8_t *)frame;
    uint16_t i;

    g_scan.source0_sync_found = 0U;
    g_scan.source0_sync_byte = 0U;
    g_scan.source0_sync_bit = 0U;

    ch585_scan_snapshot_source0_capture();

    if (ch585_scan_try_first_bit_repair(g_source0_capture, frame) == 0)
    {
        return 0;
    }

    if (ch585_scan_find_frame_in_stream(g_source0_capture,
                                        APP_CH585_SPI_SOURCE0_CAPTURE_BYTES,
                                        frame,
                                        &g_scan.source0_sync_byte,
                                        &g_scan.source0_sync_bit) == 0)
    {
        g_scan.source0_sync_found = 1U;
        return 0;
    }

    for (i = 0U; i < sizeof(*frame); i++)
    {
        rx[i] = g_source0_capture[i];
    }

