lixc929/hardware/rtthread_port/applications/ch585_spi_scan.c
    return 0;
}

static int ch585_scan_fetch_source0_soft_spi(ch585_scan_frame_v1_t *frame)
{
    uint32_t cycle_begin;
    uint32_t cycle_delta;
    uint32_t xfer_us;
    uint32_t bit_count;
    uint16_t i;

    if ((frame == RT_NULL) || (g_soft_spi.ready == 0U))
    {
        return -1;
    }

    g_scan.source0_miso_idle[0] = (uint8_t)rt_pin_read(g_soft_spi.miso0);

    /* One host request clocks exactly one CH585 frame. */
    rt_pin_write(g_soft_spi.cs0, PIN_LOW);
    if (APP_CH585_SPI_CS_SETUP_MS != 0U)
    {
        rt_thread_mdelay(APP_CH585_SPI_CS_SETUP_MS);
    }
    else
    {
        ch585_soft_spi_delay();
        ch585_soft_spi_delay();
    }

    cycle_begin = ch585_cycle_now();
    for (i = 0U; i < APP_CH585_SPI_SOURCE0_CAPTURE_BYTES; i++)
    {
        g_source0_capture[i] = ch585_soft_spi_transfer_byte(0xFFU);
    }
    cycle_delta = ch585_cycle_now() - cycle_begin;
    bit_count = (uint32_t)APP_CH585_SPI_SOURCE0_CAPTURE_BYTES * 8U;
    g_scan.source0_xfer_cycles = cycle_delta;
    if (SystemCoreClock != 0U)
    {
        xfer_us = (uint32_t)((((uint64_t)cycle_delta * 1000000ULL) +
                              ((uint64_t)SystemCoreClock / 2ULL)) /
                             (uint64_t)SystemCoreClock);
        if (xfer_us == 0U)
        {
            xfer_us = 1U;
        }
        g_scan.source0_xfer_us = xfer_us;
        g_scan.source0_sck_khz_x10 = (uint32_t)(((uint64_t)bit_count * 10000ULL) /
                                                (uint64_t)xfer_us);
        g_scan.source0_frame_fps_x10 = (uint32_t)(10000000ULL / (uint64_t)xfer_us);
    }
    else
    {
        g_scan.source0_xfer_us = 0U;
        g_scan.source0_sck_khz_x10 = 0U;
        g_scan.source0_frame_fps_x10 = 0U;
    }

    g_scan.source0_miso_idle[1] = (uint8_t)rt_pin_read(g_soft_spi.miso0);
    ch585_soft_spi_delay();
    rt_pin_write(g_soft_spi.cs0, PIN_HIGH);
    ch585_soft_spi_delay();
    g_scan.source0_miso_idle[2] = (uint8_t)rt_pin_read(g_soft_spi.miso0);

    g_scan.source0_backend = CH585_SPI_BACKEND_CPU_GPIO;
    return ch585_scan_decode_source0_capture(frame);
}

#if APP_CH585_SPI_HW_SPI2_BACKEND
static void ch585_hw_spi2_flush_rx(void)
{
    volatile uint16_t dummy;

    while (SPI_I2S_GetFlagStatus(SPI2, SPI_I2S_FLAG_RXNE) != RESET)
    {
        dummy = SPI_I2S_ReceiveData(SPI2);
        (void)dummy;
    }

    dummy = SPI2->STATR;
    dummy = SPI2->DATAR;
    (void)dummy;
}

static int ch585_hw_spi2_cmd_xfer(const ch585_scan_cmd_v1_t *cmd)
{
    const uint8_t *tx = (const uint8_t *)cmd;
    uint8_t *rx = (uint8_t *)&g_source0_spi2_cmd_rx;
    uint32_t timeout_cycles;
    uint32_t start;
    uint16_t i;

    if (cmd == RT_NULL)
    {
        return -1;
    }

    memset(&g_source0_spi2_cmd_rx, 0, sizeof(g_source0_spi2_cmd_rx));

#if APP_CH585_SPI_HW_SPI2_GPIO_CS
    GPIO_SetBits(GPIOB, GPIO_Pin_12);
#endif
    DMA_Cmd(DMA1_Channel2, DISABLE);
    DMA_Cmd(DMA1_Channel3, DISABLE);
    SPI_I2S_DMACmd(SPI2, SPI_I2S_DMAReq_Rx, DISABLE);
    SPI_I2S_DMACmd(SPI2, SPI_I2S_DMAReq_Tx, DISABLE);
    SPI_Cmd(SPI2, DISABLE);
    ch585_hw_spi2_flush_rx();

    timeout_cycles = (SystemCoreClock != 0U) ? (SystemCoreClock / 100U) : 4000000U;
    SPI_Cmd(SPI2, ENABLE);
#if APP_CH585_SPI_HW_SPI2_GPIO_CS
    GPIO_ResetBits(GPIOB, GPIO_Pin_12);
#endif
    if (APP_CH585_SPI_CS_SETUP_MS != 0U)
    {
        rt_thread_mdelay(APP_CH585_SPI_CS_SETUP_MS);
    }
    else
    {
        ch585_soft_spi_delay();
        ch585_soft_spi_delay();
    }

    for (i = 0U; i < (uint16_t)sizeof(ch585_scan_cmd_v1_t); i++)
    {
        start = ch585_cycle_now();
        while ((SPI_I2S_GetFlagStatus(SPI2, SPI_I2S_FLAG_TXE) == RESET) &&
               ((uint32_t)(ch585_cycle_now() - start) < timeout_cycles))
        {
        }
        if (SPI_I2S_GetFlagStatus(SPI2, SPI_I2S_FLAG_TXE) == RESET)
        {
            goto timeout;
        }

        SPI_I2S_SendData(SPI2, tx[i]);

        start = ch585_cycle_now();
        while ((SPI_I2S_GetFlagStatus(SPI2, SPI_I2S_FLAG_RXNE) == RESET) &&
               ((uint32_t)(ch585_cycle_now() - start) < timeout_cycles))
        {
        }
        if (SPI_I2S_GetFlagStatus(SPI2, SPI_I2S_FLAG_RXNE) == RESET)
        {
            goto timeout;
        }

        rx[i] = (uint8_t)SPI_I2S_ReceiveData(SPI2);
    }

    start = ch585_cycle_now();
    while ((SPI_I2S_GetFlagStatus(SPI2, SPI_I2S_FLAG_BSY) != RESET) &&
           ((uint32_t)(ch585_cycle_now() - start) < timeout_cycles))
    {
    }
    if (SPI_I2S_GetFlagStatus(SPI2, SPI_I2S_FLAG_BSY) != RESET)
    {
        goto timeout;
    }

#if APP_CH585_SPI_HW_SPI2_GPIO_CS
    GPIO_SetBits(GPIOB, GPIO_Pin_12);
#endif
    SPI_Cmd(SPI2, DISABLE);
    for (i = 0U; (i < sizeof(g_scan.source0_cmd_rx)) && (i < sizeof(g_source0_spi2_cmd_rx)); i++)
    {
        g_scan.source0_cmd_rx[i] = rx[i];
    }
    g_scan.source0_cmd_runs++;
    return 0;

timeout:
#if APP_CH585_SPI_HW_SPI2_GPIO_CS
    GPIO_SetBits(GPIOB, GPIO_Pin_12);
#endif
    SPI_Cmd(SPI2, DISABLE);
    g_scan.source0_cmd_runs++;
    g_scan.source0_cmd_timeouts++;
    return -1;
}

static int ch585_hw_spi2_drain_xfer(uint16_t len)
{
    uint32_t timeout_cycles;
    uint32_t start;
    uint16_t i;

#if APP_CH585_SPI_HW_SPI2_GPIO_CS
    GPIO_SetBits(GPIOB, GPIO_Pin_12);
#endif
    DMA_Cmd(DMA1_Channel2, DISABLE);
    DMA_Cmd(DMA1_Channel3, DISABLE);
    SPI_I2S_DMACmd(SPI2, SPI_I2S_DMAReq_Rx, DISABLE);
    SPI_I2S_DMACmd(SPI2, SPI_I2S_DMAReq_Tx, DISABLE);
    SPI_Cmd(SPI2, DISABLE);
    ch585_hw_spi2_flush_rx();

    timeout_cycles = (SystemCoreClock != 0U) ? (SystemCoreClock / 100U) : 4000000U;
    SPI_Cmd(SPI2, ENABLE);
#if APP_CH585_SPI_HW_SPI2_GPIO_CS
    GPIO_ResetBits(GPIOB, GPIO_Pin_12);
#endif

    for (i = 0U; i < len; i++)
    {
        start = ch585_cycle_now();
        while ((SPI_I2S_GetFlagStatus(SPI2, SPI_I2S_FLAG_TXE) == RESET) &&
               ((uint32_t)(ch585_cycle_now() - start) < timeout_cycles))
        {
        }
        if (SPI_I2S_GetFlagStatus(SPI2, SPI_I2S_FLAG_TXE) == RESET)
        {
            goto timeout;
        }

        SPI_I2S_SendData(SPI2, 0xFFU);

        start = ch585_cycle_now();
        while ((SPI_I2S_GetFlagStatus(SPI2, SPI_I2S_FLAG_RXNE) == RESET) &&
               ((uint32_t)(ch585_cycle_now() - start) < timeout_cycles))
        {
        }
        if (SPI_I2S_GetFlagStatus(SPI2, SPI_I2S_FLAG_RXNE) == RESET)
        {
            goto timeout;
        }

        (void)SPI_I2S_ReceiveData(SPI2);
    }

    start = ch585_cycle_now();
    while ((SPI_I2S_GetFlagStatus(SPI2, SPI_I2S_FLAG_BSY) != RESET) &&
           ((uint32_t)(ch585_cycle_now() - start) < timeout_cycles))
    {
    }
    if (SPI_I2S_GetFlagStatus(SPI2, SPI_I2S_FLAG_BSY) != RESET)
    {
        goto timeout;
    }

