lixc929/hardware/rtthread_port/applications/ch585_spi_scan.c
#if APP_CH585_SPI_HW_SPI2_GPIO_CS
    GPIO_SetBits(GPIOB, GPIO_Pin_12);
#endif
    SPI_Cmd(SPI2, DISABLE);
    return 0;

timeout:
#if APP_CH585_SPI_HW_SPI2_GPIO_CS
    GPIO_SetBits(GPIOB, GPIO_Pin_12);
#endif
    SPI_Cmd(SPI2, DISABLE);
    return -1;
}

static void ch585_hw_spi2_prepare_cmd(void)
{
    ch585_scan_pending_cmd_t cmd;

    memset(&g_source0_spi2_cmd_tx, 0, sizeof(g_source0_spi2_cmd_tx));
    memset(&cmd, 0, sizeof(cmd));

    g_scan.source0_host_seq = (uint16_t)(g_scan.source0_host_seq + 1U);

    if (g_scan.source0_pending_cmd.pending != 0U)
    {
        cmd = g_scan.source0_pending_cmd;
        memset(&g_scan.source0_pending_cmd, 0, sizeof(g_scan.source0_pending_cmd));
    }
    else
    {
        cmd.cmd = CH585_SCAN_CMD_GET_STATE;
        cmd.target_key = 0U;
        cmd.param_id = 0U;
        cmd.value = 0U;
        cmd.flags = 0U;
        cmd.aux = 0U;
    }

#if APP_CH585_SPI_WIRE_SHORT
    g_source0_spi2_cmd_tx.magic = CH585_SCAN_SHORT_CMD_MAGIC;
    g_source0_spi2_cmd_tx.cmd = cmd.cmd;
    g_source0_spi2_cmd_tx.host_seq = (uint8_t)g_scan.source0_host_seq;
    g_source0_spi2_cmd_tx.ack_seq =
        (g_scan.source[0].have_seq != 0U) ? (uint8_t)g_scan.source[0].last_seq : 0xFFU;
    g_source0_spi2_cmd_tx.target_key = cmd.target_key;
    g_source0_spi2_cmd_tx.param_id = cmd.param_id;
    g_source0_spi2_cmd_tx.value = cmd.value;
    g_source0_spi2_cmd_tx.flags = cmd.flags;
    g_source0_spi2_cmd_tx.aux = cmd.aux;
    memset(g_source0_spi2_cmd_tx.reserved, 0, sizeof(g_source0_spi2_cmd_tx.reserved));
#else
    g_source0_spi2_cmd_tx.magic = CH585_SCAN_CMD_MAGIC;
    g_source0_spi2_cmd_tx.version = CH585_SCAN_FRAME_VERSION;
    g_source0_spi2_cmd_tx.cmd = cmd.cmd;
    g_source0_spi2_cmd_tx.host_seq = g_scan.source0_host_seq;
    g_source0_spi2_cmd_tx.ack_seq =
        (g_scan.source[0].have_seq != 0U) ? g_scan.source[0].last_seq : 0xFFFFU;
    g_source0_spi2_cmd_tx.flags = cmd.flags;
#endif
    g_source0_spi2_cmd_tx.crc16 =
        ch585_spi_scan_crc16((const uint8_t *)&g_source0_spi2_cmd_tx,
                             (uint16_t)offsetof(ch585_scan_cmd_v1_t, crc16));
    g_scan.source0_cmd_sent++;
    g_scan.source0_last_cmd = cmd.cmd;
    if (cmd.cmd == CH585_SCAN_CMD_GET_DEBUG)
    {
        g_scan.source0_debug_cmd_sent++;
    }
    else if ((cmd.cmd == CH585_SCAN_CMD_CALIBRATE_KEY) ||
             (cmd.cmd == CH585_SCAN_CMD_CALIBRATE_ALL))
    {
        g_scan.source0_calibrate_cmd_sent++;
    }
}

static void ch585_hw_spi2_prepare_pipeline_tx(void)
{
    memset(g_source0_spi2_tx, 0xFF, sizeof(g_source0_spi2_tx));
    ch585_hw_spi2_prepare_cmd();
    memcpy(g_source0_spi2_tx, &g_source0_spi2_cmd_tx, sizeof(g_source0_spi2_cmd_tx));
}

static int ch585_hw_spi2_dma_frame_xfer(void)
{
    DMA_InitTypeDef dma_tx = {0};
    DMA_InitTypeDef dma_rx = {0};
    uint32_t cycle_begin;
    uint32_t cycle_delta;
    uint32_t timeout_cycles;
    uint32_t xfer_us;
    uint32_t bit_count;
    uint32_t flags;

    memset(g_source0_spi2_rx, 0x00, sizeof(g_source0_spi2_rx));

    g_scan.source0_miso_idle[0] =
        ((GPIOC->INDR & GPIO_Pin_2) != 0U) ? 1U : 0U;

#if APP_CH585_SPI_HW_SPI2_GPIO_CS
    GPIO_SetBits(GPIOB, GPIO_Pin_12);
#endif

    DMA_Cmd(DMA1_Channel2, DISABLE);
    DMA_Cmd(DMA1_Channel3, DISABLE);
    SPI_I2S_DMACmd(SPI2, SPI_I2S_DMAReq_Rx, DISABLE);
    SPI_I2S_DMACmd(SPI2, SPI_I2S_DMAReq_Tx, DISABLE);
    SPI_Cmd(SPI2, DISABLE);
    DMA_ClearFlag(DMA1, DMA1_FLAG_GL2 | DMA1_FLAG_GL3);
    ch585_hw_spi2_flush_rx();

    dma_tx.DMA_PeripheralBaseAddr = (uint32_t)&SPI2->DATAR;
    dma_tx.DMA_Memory0BaseAddr = (uint32_t)g_source0_spi2_tx;
    dma_tx.DMA_DIR = DMA_DIR_PeripheralDST;
    dma_tx.DMA_BufferSize = APP_CH585_SPI_SOURCE0_CAPTURE_BYTES;
    dma_tx.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
    dma_tx.DMA_MemoryInc = DMA_MemoryInc_Enable;
    dma_tx.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
    dma_tx.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
    dma_tx.DMA_Mode = DMA_Mode_Normal;
    dma_tx.DMA_Priority = DMA_Priority_VeryHigh;
    dma_tx.DMA_M2M = DMA_M2M_Disable;

    dma_rx.DMA_PeripheralBaseAddr = (uint32_t)&SPI2->DATAR;
    dma_rx.DMA_Memory0BaseAddr = (uint32_t)g_source0_spi2_rx;
    dma_rx.DMA_DIR = DMA_DIR_PeripheralSRC;
    dma_rx.DMA_BufferSize = APP_CH585_SPI_SOURCE0_CAPTURE_BYTES;
    dma_rx.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
    dma_rx.DMA_MemoryInc = DMA_MemoryInc_Enable;
    dma_rx.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
    dma_rx.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
    dma_rx.DMA_Mode = DMA_Mode_Normal;
    dma_rx.DMA_Priority = DMA_Priority_VeryHigh;
    dma_rx.DMA_M2M = DMA_M2M_Disable;

    DMA_DeInit(DMA1_Channel2);
    DMA_DeInit(DMA1_Channel3);
    DMA_Init(DMA1_Channel2, &dma_rx);
    DMA_Init(DMA1_Channel3, &dma_tx);
    DMA_MuxChannelConfig(DMA_MuxChannel2, CH585_SPI2_RX_DMA_REQ);
    DMA_MuxChannelConfig(DMA_MuxChannel3, CH585_SPI2_TX_DMA_REQ);
    DMA_ClearFlag(DMA1, DMA1_FLAG_GL2 | DMA1_FLAG_GL3);

    SPI_I2S_DMACmd(SPI2, SPI_I2S_DMAReq_Rx, ENABLE);
    SPI_I2S_DMACmd(SPI2, SPI_I2S_DMAReq_Tx, ENABLE);
#if APP_CH585_SPI_HW_SPI2_GPIO_CS
    GPIO_ResetBits(GPIOB, GPIO_Pin_12);
#endif
    SPI_Cmd(SPI2, ENABLE);

    if (APP_CH585_SPI_CS_SETUP_MS != 0U)
    {
        rt_thread_mdelay(APP_CH585_SPI_CS_SETUP_MS);
    }
    else
    {
        ch585_soft_spi_delay();
        ch585_soft_spi_delay();
    }

    cycle_begin = ch585_cycle_now();
    DMA_Cmd(DMA1_Channel2, ENABLE);
    DMA_Cmd(DMA1_Channel3, ENABLE);

    timeout_cycles = (SystemCoreClock != 0U) ? (SystemCoreClock / 5U) : 80000000U;
    while ((((DMA_GetFlagStatus(DMA1, DMA1_FLAG_TC2) == RESET) ||
             (DMA_GetFlagStatus(DMA1, DMA1_FLAG_TC3) == RESET)) ||
            (SPI_I2S_GetFlagStatus(SPI2, SPI_I2S_FLAG_BSY) != RESET)) &&
           ((uint32_t)(ch585_cycle_now() - cycle_begin) < timeout_cycles))
    {
    }

    cycle_delta = ch585_cycle_now() - cycle_begin;
    flags = DMA1->INTFR;

#if APP_CH585_SPI_HW_SPI2_GPIO_CS
    GPIO_SetBits(GPIOB, GPIO_Pin_12);
#endif
    DMA_Cmd(DMA1_Channel3, DISABLE);
    DMA_Cmd(DMA1_Channel2, DISABLE);
    SPI_I2S_DMACmd(SPI2, SPI_I2S_DMAReq_Tx, DISABLE);
    SPI_I2S_DMACmd(SPI2, SPI_I2S_DMAReq_Rx, DISABLE);
    g_scan.source0_spi2_sr_last = SPI2->STATR;
    g_scan.source0_miso_idle[1] =
        ((GPIOC->INDR & GPIO_Pin_2) != 0U) ? 1U : 0U;
    SPI_Cmd(SPI2, DISABLE);
    ch585_soft_spi_delay();
    g_scan.source0_miso_idle[2] =
        ((GPIOC->INDR & GPIO_Pin_2) != 0U) ? 1U : 0U;

    g_scan.source0_spi2_runs++;
    if (((flags & DMA1_FLAG_TC2) == 0U) || ((flags & DMA1_FLAG_TC3) == 0U))
    {
        g_scan.source0_spi2_timeouts++;
    }
    if ((flags & (DMA1_FLAG_TE2 | DMA1_FLAG_TE3)) != 0U)
    {
        g_scan.source0_spi2_te_flags++;
    }

