lixc929/hardware/rtthread_port/applications/ch585_spi_scan.c
    memcpy(g_source0_capture, g_source0_spi2_rx, sizeof(g_source0_capture));

    bit_count = (uint32_t)APP_CH585_SPI_SOURCE0_CAPTURE_BYTES * 8U;
    g_scan.source0_xfer_cycles = cycle_delta;
    if (SystemCoreClock != 0U)
    {
        xfer_us = (uint32_t)((((uint64_t)cycle_delta * 1000000ULL) +
                              ((uint64_t)SystemCoreClock / 2ULL)) /
                             (uint64_t)SystemCoreClock);
        if (xfer_us == 0U)
        {
            xfer_us = 1U;
        }
        g_scan.source0_xfer_us = xfer_us;
        g_scan.source0_sck_khz_x10 = (uint32_t)(((uint64_t)bit_count * 10000ULL) /
                                                (uint64_t)xfer_us);
        g_scan.source0_frame_fps_x10 = (uint32_t)(10000000ULL / (uint64_t)xfer_us);
    }
    else
    {
        g_scan.source0_xfer_us = 0U;
        g_scan.source0_sck_khz_x10 = ch585_hw_spi2_expected_sck_khz_x10();
        g_scan.source0_frame_fps_x10 = 0U;
    }

    g_scan.source0_backend = CH585_SPI_BACKEND_HW_SPI2_HARDNSS;

    return (((flags & DMA1_FLAG_TC2) != 0U) && ((flags & DMA1_FLAG_TC3) != 0U)) ? 0 : -1;
}

#if APP_CH585_SPI_AUTO_TRAIN && APP_CH585_SPI_WIRE_SHORT && APP_CH585_SPI_REQUEST_ONLY_SHORT
typedef struct
{
    uint16_t prescaler;
    uint8_t hsrx;
    uint16_t cpha;
    const char *name;
} ch585_spi_train_candidate_t;

static int ch585_hw_spi2_train_try(const ch585_spi_train_candidate_t *candidate,
                                   uint16_t *bad_out,
                                   uint16_t *seq_out)
{
    ch585_scan_frame_v1_t frame;
    uint16_t bad_errors = 0U;
    uint16_t seq_errors = 0U;
    uint8_t have_seq = 0U;
    uint8_t last_seq = 0U;
    uint8_t i;
    uint8_t warmup;

    if ((candidate == RT_NULL) || (bad_out == RT_NULL) || (seq_out == RT_NULL))
    {
        return -1;
    }

    ch585_hw_spi2_apply_config(candidate->prescaler, candidate->hsrx, candidate->cpha);

    ch585_cycle_delay_us(APP_CH585_SPI_RESYNC_TO_CMD_US);

    for (warmup = 0U; warmup < (uint8_t)APP_CH585_SPI_TRAIN_WARMUP_FRAMES; warmup++)
    {
        if (ch585_hw_spi2_drain_xfer((uint16_t)APP_CH585_SPI_SOURCE0_CAPTURE_BYTES) != 0)
        {
            ch585_cycle_delay_us(APP_CH585_SPI_RESYNC_TO_CMD_US);
        }
        ch585_cycle_delay_us(APP_CH585_SPI_TRAIN_INTERFRAME_US);
    }

    for (i = 0U; i < APP_CH585_SPI_TRAIN_FRAMES; i++)
    {
        memset(g_source0_spi2_tx, 0xFF, sizeof(g_source0_spi2_tx));
        if (ch585_hw_spi2_dma_frame_xfer() != 0)
        {
            bad_errors++;
            ch585_cycle_delay_us(APP_CH585_SPI_TRAIN_INTERFRAME_US);
            continue;
        }

        if (ch585_scan_decode_source0_capture(&frame) != 0)
        {
            bad_errors++;
            ch585_cycle_delay_us(APP_CH585_SPI_TRAIN_INTERFRAME_US);
            continue;
        }

        if (ch585_scan_frame_is_valid(&frame) == 0)
        {
            bad_errors++;
            ch585_cycle_delay_us(APP_CH585_SPI_TRAIN_INTERFRAME_US);
            continue;
        }

        if ((have_seq != 0U) && (frame.seq != (uint8_t)(last_seq + 1U)))
        {
            seq_errors++;
        }
        last_seq = frame.seq;
        have_seq = 1U;
        ch585_cycle_delay_us(APP_CH585_SPI_TRAIN_INTERFRAME_US);
    }

    *bad_out = bad_errors;
    *seq_out = seq_errors;
    rt_kprintf("CH585 SPI train: %s prescaler=0x%04x hsrx=%u cpha=%u expect=%u.%u kHz bad=%u/%u seq=%u warmup=%u gap=%u us\r\n",
               candidate->name,
               (unsigned int)candidate->prescaler,
               (unsigned int)candidate->hsrx,
               (unsigned int)((candidate->cpha == SPI_CPHA_2Edge) ? 2U : 1U),
               (unsigned int)(ch585_hw_spi2_expected_sck_khz_x10() / 10U),
               (unsigned int)(ch585_hw_spi2_expected_sck_khz_x10() % 10U),
               (unsigned int)bad_errors,
               (unsigned int)APP_CH585_SPI_TRAIN_FRAMES,
               (unsigned int)seq_errors,
               (unsigned int)APP_CH585_SPI_TRAIN_WARMUP_FRAMES,
               (unsigned int)APP_CH585_SPI_TRAIN_INTERFRAME_US);

    return 0;
}

static int ch585_hw_spi2_train(void)
{
    static const ch585_spi_train_candidate_t candidates[] = {
        { SPI_BaudRatePrescaler_Mode0, 2U, SPI_CPHA_1Edge, "mode0-hsrx2-cpha1" },
        { SPI_BaudRatePrescaler_Mode0, 1U, SPI_CPHA_1Edge, "mode0-hsrx1-cpha1" },
        { SPI_BaudRatePrescaler_Mode1, 2U, SPI_CPHA_1Edge, "mode1-hsrx2-cpha1" },
        { SPI_BaudRatePrescaler_Mode1, 1U, SPI_CPHA_1Edge, "mode1-hsrx1-cpha1" },
        { SPI_BaudRatePrescaler_Mode2, 2U, SPI_CPHA_1Edge, "mode2-hsrx2-cpha1" },
        { SPI_BaudRatePrescaler_Mode2, 1U, SPI_CPHA_1Edge, "mode2-hsrx1-cpha1" },
        { SPI_BaudRatePrescaler_Mode2, 1U, SPI_CPHA_2Edge, "mode2-hsrx1-cpha2" },
        { SPI_BaudRatePrescaler_Mode3, 2U, SPI_CPHA_1Edge, "mode3-hsrx2-cpha1" },
        { SPI_BaudRatePrescaler_Mode3, 1U, SPI_CPHA_2Edge, "mode3-hsrx1-cpha2" },
        { SPI_BaudRatePrescaler_Mode3, 1U, SPI_CPHA_1Edge, "mode3-hsrx1-cpha1" },
        { SPI_BaudRatePrescaler_Mode4, 2U, SPI_CPHA_1Edge, "mode4-hsrx2-cpha1" },
        { SPI_BaudRatePrescaler_Mode4, 1U, SPI_CPHA_1Edge, "mode4-hsrx1-cpha1" },
        { SPI_BaudRatePrescaler_Mode5, 1U, SPI_CPHA_1Edge, "mode5-hsrx1-cpha1" },
    };
    const ch585_spi_train_candidate_t *selected = RT_NULL;
    const ch585_spi_train_candidate_t *best_seen = &candidates[sizeof(candidates) / sizeof(candidates[0]) - 1U];
    uint16_t best_errors = 0xFFFFU;
    uint16_t best_bad_errors = 0xFFFFU;
    uint16_t bad_errors;
    uint16_t seq_errors;
    uint16_t total_errors;
    uint8_t i;

    rt_kprintf("CH585 SPI train: start candidates=%u frames=%u\r\n",
               (unsigned int)(sizeof(candidates) / sizeof(candidates[0])),
               (unsigned int)APP_CH585_SPI_TRAIN_FRAMES);
    g_scan.source0_train_candidate_count = 0U;

    for (i = 0U; i < (uint8_t)(sizeof(candidates) / sizeof(candidates[0])); i++)
    {
        if (ch585_hw_spi2_train_try(&candidates[i], &bad_errors, &seq_errors) != 0)
        {
            bad_errors = 0xFFFFU;
            seq_errors = 0xFFFFU;
        }

        if (i < APP_CH585_SPI_TRAIN_MAX_CANDIDATES)
        {
            g_scan.source0_train_candidate_prescaler[i] = candidates[i].prescaler;
            g_scan.source0_train_candidate_hsrx[i] = candidates[i].hsrx;
            g_scan.source0_train_candidate_cpha[i] =
                (uint8_t)((candidates[i].cpha == SPI_CPHA_2Edge) ? 2U : 1U);
            g_scan.source0_train_candidate_bad[i] = bad_errors;
            g_scan.source0_train_candidate_seq[i] = seq_errors;
            g_scan.source0_train_candidate_count = (uint8_t)(i + 1U);
        }

        if ((bad_errors == 0xFFFFU) || (seq_errors == 0xFFFFU))
        {
            total_errors = 0xFFFFU;
        }
        else
        {
            total_errors = (uint16_t)(bad_errors + seq_errors);
        }

