lixc929/hardware/rtthread_port/applications/ch585_spi_scan.c
        if ((total_errors < best_errors) ||
            ((total_errors == best_errors) && (bad_errors < best_bad_errors)))
        {
            best_errors = total_errors;
            best_bad_errors = bad_errors;
            best_seen = &candidates[i];
        }

        if ((bad_errors == 0U) && (seq_errors == 0U))
        {
            selected = &candidates[i];
            break;
        }
    }

    if (selected == RT_NULL)
    {
        selected = best_seen;
    }

    ch585_hw_spi2_apply_config(selected->prescaler, selected->hsrx, selected->cpha);
    g_scan.source0_train_errors = best_errors;
    g_scan.source0_train_frames = APP_CH585_SPI_TRAIN_FRAMES;
    g_scan.source0_need_resync = 1U;
    g_scan.source0_pipeline_primed = 0U;
    g_scan.source0_spi2_runs = 0U;
    g_scan.source0_spi2_timeouts = 0U;
    g_scan.source0_spi2_te_flags = 0U;
    g_scan.source[0].have_seq = 0U;
    g_scan.source0_train_done = 1U;

    rt_kprintf("CH585 SPI train: selected %s prescaler=0x%04x hsrx=%u cpha=%u expect=%u.%u kHz errors=%u/%u\r\n",
               selected->name,
               (unsigned int)selected->prescaler,
               (unsigned int)selected->hsrx,
               (unsigned int)((selected->cpha == SPI_CPHA_2Edge) ? 2U : 1U),
               (unsigned int)(ch585_hw_spi2_expected_sck_khz_x10() / 10U),
               (unsigned int)(ch585_hw_spi2_expected_sck_khz_x10() % 10U),
               (unsigned int)best_errors,
               (unsigned int)APP_CH585_SPI_TRAIN_FRAMES);

    return (best_errors == 0U) ? 0 : -1;
}
#else
static int ch585_hw_spi2_train(void)
{
    return 0;
}
#endif

#if APP_CH585_SPI_PIPELINE_SHORT && APP_CH585_SPI_WIRE_SHORT
static int ch585_scan_fetch_source0_hw_spi2_pipeline(ch585_scan_frame_v1_t *frame)
{
    uint16_t expected_ack;

    if ((frame == RT_NULL) || (g_scan.source0_spi2_ready == 0U))
    {
        return -1;
    }

    if ((g_scan.source0_need_resync != 0U) || (g_scan.source0_pipeline_primed == 0U))
    {
        g_scan.source0_resync_runs++;
        if (ch585_hw_spi2_drain_xfer((uint16_t)APP_CH585_SPI_SOURCE0_CAPTURE_BYTES) != 0)
        {
            return -1;
        }
        ch585_cycle_delay_us(APP_CH585_SPI_RESYNC_TO_CMD_US);

        ch585_hw_spi2_prepare_pipeline_tx();
        if (ch585_hw_spi2_dma_frame_xfer() != 0)
        {
            g_scan.source0_need_resync = 1U;
            g_scan.source0_pipeline_primed = 0U;
            return -1;
        }

        g_scan.source0_pipeline_ack_seq = g_scan.source0_host_seq;
        g_scan.source0_pipeline_primed = 1U;
        g_scan.source0_need_resync = 0U;
    }

    ch585_cycle_delay_us(APP_CH585_SPI_CMD_TO_DATA_US);
    expected_ack = g_scan.source0_pipeline_ack_seq;
    ch585_hw_spi2_prepare_pipeline_tx();
    if (ch585_hw_spi2_dma_frame_xfer() != 0)
    {
        g_scan.source0_need_resync = 1U;
        g_scan.source0_pipeline_primed = 0U;
        return -1;
    }

    g_scan.source0_accept_ack_seq = expected_ack;
    g_scan.source0_pipeline_ack_seq = g_scan.source0_host_seq;

    return ch585_scan_decode_source0_capture(frame);
}
#endif

#if APP_CH585_SPI_REQUEST_ONLY_SHORT && APP_CH585_SPI_WIRE_SHORT
static int ch585_scan_fetch_source0_hw_spi2_request_only(ch585_scan_frame_v1_t *frame)
{
    uint16_t expected_ack;

    if ((frame == RT_NULL) || (g_scan.source0_spi2_ready == 0U))
    {
        return -1;
    }

    if (g_scan.source0_need_resync != 0U)
    {
        g_scan.source0_resync_runs++;
        if (ch585_hw_spi2_drain_xfer((uint16_t)APP_CH585_SPI_SOURCE0_CAPTURE_BYTES) != 0)
        {
            return -1;
        }
        g_scan.source0_need_resync = 0U;
        g_scan.source0_pipeline_primed = 0U;
        ch585_cycle_delay_us(APP_CH585_SPI_RESYNC_TO_CMD_US);
    }

    expected_ack = (g_scan.source0_pipeline_primed != 0U) ?
                   g_scan.source0_pipeline_ack_seq : 0x00FFU;

    memset(g_source0_spi2_tx, 0xFF, sizeof(g_source0_spi2_tx));
    ch585_hw_spi2_prepare_cmd();
    memcpy(g_source0_spi2_tx, &g_source0_spi2_cmd_tx, sizeof(g_source0_spi2_cmd_tx));
    if (ch585_hw_spi2_dma_frame_xfer() != 0)
    {
        g_scan.source0_need_resync = 1U;
        return -1;
    }

    g_scan.source0_accept_ack_seq = expected_ack;
    if (ch585_scan_decode_source0_capture(frame) != 0)
    {
        return -1;
    }

    g_scan.source0_pipeline_ack_seq = (uint8_t)g_scan.source0_host_seq;
    g_scan.source0_pipeline_primed = 1U;
    return 0;
}
#endif

static int ch585_scan_fetch_source0_hw_spi2(ch585_scan_frame_v1_t *frame)
{
    DMA_InitTypeDef dma_tx = {0};
    DMA_InitTypeDef dma_rx = {0};
    uint32_t cycle_begin;
    uint32_t cycle_delta;
    uint32_t timeout_cycles;
    uint32_t xfer_us;
    uint32_t bit_count;
    uint32_t flags;

    if ((frame == RT_NULL) || (g_scan.source0_spi2_ready == 0U))
    {
        return -1;
    }

    if ((g_scan.source0_need_resync != 0U) ||
        (APP_CH585_SPI_RESYNC_EVERY_POLL != 0U))
    {
        g_scan.source0_resync_runs++;
        g_scan.source0_need_resync = 0U;
#if APP_CH585_SPI_CMD_TO_DATA_MS
        rt_thread_mdelay(APP_CH585_SPI_CMD_TO_DATA_MS);
#endif
        ch585_cycle_delay_us(APP_CH585_SPI_RESYNC_TO_CMD_US);
    }

    ch585_hw_spi2_prepare_cmd();
    if (ch585_hw_spi2_cmd_xfer(&g_source0_spi2_cmd_tx) != 0)
    {
        g_scan.source0_need_resync = 1U;
        return -1;
    }
    g_scan.source0_accept_ack_seq = g_scan.source0_host_seq;
#if APP_CH585_SPI_CMD_TO_DATA_MS
    rt_thread_mdelay(APP_CH585_SPI_CMD_TO_DATA_MS);
#endif
    ch585_cycle_delay_us(APP_CH585_SPI_CMD_TO_DATA_US);

    memset(g_source0_spi2_tx, 0xFF, sizeof(g_source0_spi2_tx));
    memset(g_source0_spi2_rx, 0x00, sizeof(g_source0_spi2_rx));

    g_scan.source0_miso_idle[0] =
        ((GPIOC->INDR & GPIO_Pin_2) != 0U) ? 1U : 0U;

#if APP_CH585_SPI_HW_SPI2_GPIO_CS
    GPIO_SetBits(GPIOB, GPIO_Pin_12);
#endif

    DMA_Cmd(DMA1_Channel2, DISABLE);
    DMA_Cmd(DMA1_Channel3, DISABLE);
    SPI_I2S_DMACmd(SPI2, SPI_I2S_DMAReq_Rx, DISABLE);
    SPI_I2S_DMACmd(SPI2, SPI_I2S_DMAReq_Tx, DISABLE);
    SPI_Cmd(SPI2, DISABLE);
    DMA_ClearFlag(DMA1, DMA1_FLAG_GL2 | DMA1_FLAG_GL3);
    ch585_hw_spi2_flush_rx();

