lixc929/hardware/rtthread_port/applications/ch585_spi_scan.c
    dma_tx.DMA_PeripheralBaseAddr = (uint32_t)&SPI2->DATAR;
    dma_tx.DMA_Memory0BaseAddr = (uint32_t)g_source0_spi2_tx;
    dma_tx.DMA_DIR = DMA_DIR_PeripheralDST;
    dma_tx.DMA_BufferSize = APP_CH585_SPI_SOURCE0_CAPTURE_BYTES;
    dma_tx.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
    dma_tx.DMA_MemoryInc = DMA_MemoryInc_Enable;
    dma_tx.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
    dma_tx.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
    dma_tx.DMA_Mode = DMA_Mode_Normal;
    dma_tx.DMA_Priority = DMA_Priority_VeryHigh;
    dma_tx.DMA_M2M = DMA_M2M_Disable;

    dma_rx.DMA_PeripheralBaseAddr = (uint32_t)&SPI2->DATAR;
    dma_rx.DMA_Memory0BaseAddr = (uint32_t)g_source0_spi2_rx;
    dma_rx.DMA_DIR = DMA_DIR_PeripheralSRC;
    dma_rx.DMA_BufferSize = APP_CH585_SPI_SOURCE0_CAPTURE_BYTES;
    dma_rx.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
    dma_rx.DMA_MemoryInc = DMA_MemoryInc_Enable;
    dma_rx.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
    dma_rx.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
    dma_rx.DMA_Mode = DMA_Mode_Normal;
    dma_rx.DMA_Priority = DMA_Priority_VeryHigh;
    dma_rx.DMA_M2M = DMA_M2M_Disable;

    DMA_DeInit(DMA1_Channel2);
    DMA_DeInit(DMA1_Channel3);
    DMA_Init(DMA1_Channel2, &dma_rx);
    DMA_Init(DMA1_Channel3, &dma_tx);
    DMA_MuxChannelConfig(DMA_MuxChannel2, CH585_SPI2_RX_DMA_REQ);
    DMA_MuxChannelConfig(DMA_MuxChannel3, CH585_SPI2_TX_DMA_REQ);
    DMA_ClearFlag(DMA1, DMA1_FLAG_GL2 | DMA1_FLAG_GL3);

    SPI_I2S_DMACmd(SPI2, SPI_I2S_DMAReq_Rx, ENABLE);
    SPI_I2S_DMACmd(SPI2, SPI_I2S_DMAReq_Tx, ENABLE);
#if APP_CH585_SPI_HW_SPI2_GPIO_CS
    GPIO_ResetBits(GPIOB, GPIO_Pin_12);
#endif
    SPI_Cmd(SPI2, ENABLE);

    if (APP_CH585_SPI_CS_SETUP_MS != 0U)
    {
        rt_thread_mdelay(APP_CH585_SPI_CS_SETUP_MS);
    }
    else
    {
        ch585_soft_spi_delay();
        ch585_soft_spi_delay();
    }

    cycle_begin = ch585_cycle_now();
    DMA_Cmd(DMA1_Channel2, ENABLE);
    DMA_Cmd(DMA1_Channel3, ENABLE);

    timeout_cycles = (SystemCoreClock != 0U) ? (SystemCoreClock / 5U) : 80000000U;
    while ((((DMA_GetFlagStatus(DMA1, DMA1_FLAG_TC2) == RESET) ||
             (DMA_GetFlagStatus(DMA1, DMA1_FLAG_TC3) == RESET)) ||
            (SPI_I2S_GetFlagStatus(SPI2, SPI_I2S_FLAG_BSY) != RESET)) &&
           ((uint32_t)(ch585_cycle_now() - cycle_begin) < timeout_cycles))
    {
    }

    cycle_delta = ch585_cycle_now() - cycle_begin;
    flags = DMA1->INTFR;

#if APP_CH585_SPI_HW_SPI2_GPIO_CS
    GPIO_SetBits(GPIOB, GPIO_Pin_12);
#endif
    DMA_Cmd(DMA1_Channel3, DISABLE);
    DMA_Cmd(DMA1_Channel2, DISABLE);
    SPI_I2S_DMACmd(SPI2, SPI_I2S_DMAReq_Tx, DISABLE);
    SPI_I2S_DMACmd(SPI2, SPI_I2S_DMAReq_Rx, DISABLE);
    g_scan.source0_spi2_sr_last = SPI2->STATR;
    g_scan.source0_miso_idle[1] =
        ((GPIOC->INDR & GPIO_Pin_2) != 0U) ? 1U : 0U;
    SPI_Cmd(SPI2, DISABLE);
    ch585_soft_spi_delay();
    g_scan.source0_miso_idle[2] =
        ((GPIOC->INDR & GPIO_Pin_2) != 0U) ? 1U : 0U;

    g_scan.source0_spi2_runs++;
    if (((flags & DMA1_FLAG_TC2) == 0U) || ((flags & DMA1_FLAG_TC3) == 0U))
    {
        g_scan.source0_spi2_timeouts++;
    }
    if ((flags & (DMA1_FLAG_TE2 | DMA1_FLAG_TE3)) != 0U)
    {
        g_scan.source0_spi2_te_flags++;
    }

    memcpy(g_source0_capture, g_source0_spi2_rx, sizeof(g_source0_capture));

    bit_count = (uint32_t)APP_CH585_SPI_SOURCE0_CAPTURE_BYTES * 8U;
    g_scan.source0_xfer_cycles = cycle_delta;
    if (SystemCoreClock != 0U)
    {
        xfer_us = (uint32_t)((((uint64_t)cycle_delta * 1000000ULL) +
                              ((uint64_t)SystemCoreClock / 2ULL)) /
                             (uint64_t)SystemCoreClock);
        if (xfer_us == 0U)
        {
            xfer_us = 1U;
        }
        g_scan.source0_xfer_us = xfer_us;
        g_scan.source0_sck_khz_x10 = (uint32_t)(((uint64_t)bit_count * 10000ULL) /
                                                (uint64_t)xfer_us);
        g_scan.source0_frame_fps_x10 = (uint32_t)(10000000ULL / (uint64_t)xfer_us);
    }
    else
    {
        g_scan.source0_xfer_us = 0U;
        g_scan.source0_sck_khz_x10 = ch585_hw_spi2_expected_sck_khz_x10();
        g_scan.source0_frame_fps_x10 = 0U;
    }

    g_scan.source0_backend = CH585_SPI_BACKEND_HW_SPI2_HARDNSS;
    return ch585_scan_decode_source0_capture(frame);
}
#endif

#if APP_CH585_SPI_DMA_BACKEND
static void ch585_dma_pack_source0_capture(void)
{
    uint32_t bit;
    uint32_t byte_index;
    uint8_t bit_mask;
    uint16_t sample;
    uint16_t sample_or = 0U;
    uint16_t sample_and = 0xFFFFU;

    memset(g_source0_capture, 0, sizeof(g_source0_capture));

    for (bit = 0U; bit < ((uint32_t)APP_CH585_SPI_SOURCE0_CAPTURE_BYTES * 8U); bit++)
    {
        sample = g_source0_dma_miso_sample[(bit * CH585_SPI_DMA_PHASES_PER_BIT) +
                                           CH585_SPI_DMA_SAMPLE_PHASE];
        sample_or |= sample;
        sample_and &= sample;
        if ((sample & GPIO_Pin_4) != 0U)
        {
            byte_index = bit >> 3;
            bit_mask = (uint8_t)(0x80U >> (bit & 7U));
            g_source0_capture[byte_index] |= bit_mask;
        }
    }

    g_scan.source0_dma_sample_or = sample_or;
    g_scan.source0_dma_sample_and = sample_and;
}

static int ch585_scan_fetch_source0_dma_spi(ch585_scan_frame_v1_t *frame)
{
    DMA_InitTypeDef dma_out = {0};
    DMA_InitTypeDef dma_in = {0};
    uint32_t cycle_begin;
    uint32_t cycle_delta;
    uint32_t timeout_cycles;
    uint32_t xfer_us;
    uint32_t bit_count;
    uint32_t flags;
    uint32_t i;

    if ((frame == RT_NULL) || (g_soft_spi.ready == 0U) || (g_scan.source0_dma_ready == 0U))
    {
        return -1;
    }

    g_scan.source0_miso_idle[0] = (uint8_t)rt_pin_read(g_soft_spi.miso0);

    for (i = 0U; i < CH585_SPI_DMA_PHASE_COUNT; i++)
    {
        g_source0_dma_miso_sample[i] = 0U;
    }

    DMA_Cmd(DMA1_Channel1, DISABLE);
    DMA_Cmd(DMA1_Channel2, DISABLE);
    TIM_Cmd(TIM8, DISABLE);
    TIM_DMACmd(TIM8, TIM_DMA_Update, DISABLE);
    DMA_ClearFlag(DMA1, DMA1_FLAG_GL1 | DMA1_FLAG_GL2);

    dma_out.DMA_PeripheralBaseAddr =
#if APP_CH585_SPI_DMA_USE_OUTDR
        (uint32_t)&GPIOD->OUTDR;
#else
        (uint32_t)&GPIOD->BSHR;
#endif
    dma_out.DMA_Memory0BaseAddr = (uint32_t)g_source0_dma_sck_wave;
    dma_out.DMA_DIR = DMA_DIR_PeripheralDST;
    dma_out.DMA_BufferSize = CH585_SPI_DMA_PHASE_COUNT;
    dma_out.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
    dma_out.DMA_MemoryInc = DMA_MemoryInc_Enable;
#if APP_CH585_SPI_DMA_USE_OUTDR
    dma_out.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
    dma_out.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord;
#else
    dma_out.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Word;
    dma_out.DMA_MemoryDataSize = DMA_MemoryDataSize_Word;
#endif
    dma_out.DMA_Mode = DMA_Mode_Normal;
    dma_out.DMA_Priority = DMA_Priority_VeryHigh;
    dma_out.DMA_M2M = DMA_M2M_Disable;

    dma_in.DMA_PeripheralBaseAddr = (uint32_t)&GPIOD->INDR;
    dma_in.DMA_Memory0BaseAddr = (uint32_t)g_source0_dma_miso_sample;
    dma_in.DMA_DIR = DMA_DIR_PeripheralSRC;
    dma_in.DMA_BufferSize = CH585_SPI_DMA_PHASE_COUNT;
    dma_in.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
    dma_in.DMA_MemoryInc = DMA_MemoryInc_Enable;
    dma_in.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
    dma_in.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord;
    dma_in.DMA_Mode = DMA_Mode_Normal;
    dma_in.DMA_Priority = DMA_Priority_High;
    dma_in.DMA_M2M = DMA_M2M_Disable;

    DMA_DeInit(DMA1_Channel1);
    DMA_DeInit(DMA1_Channel2);
    DMA_Init(DMA1_Channel1, &dma_out);
    DMA_Init(DMA1_Channel2, &dma_in);
    DMA_MuxChannelConfig(DMA_MuxChannel1, CH585_SPI_DMA_TIM8_UP_REQ);
    DMA_MuxChannelConfig(DMA_MuxChannel2, CH585_SPI_DMA_TIM8_UP_REQ);

