lixc929/hardware/rtthread_port/applications/ch585_spi_scan.c
    GPIOD->BSHR = GPIO_BSHR_BR2;
    rt_pin_write(g_soft_spi.mosi, PIN_HIGH);
    rt_pin_write(g_soft_spi.cs0, PIN_LOW);
    if (APP_CH585_SPI_CS_SETUP_MS != 0U)
    {
        rt_thread_mdelay(APP_CH585_SPI_CS_SETUP_MS);
    }
    else
    {
        ch585_soft_spi_delay();
        ch585_soft_spi_delay();
    }
    ch585_dma_wave_prepare();

    TIM8->CNT = 0U;
    DMA_ClearFlag(DMA1, DMA1_FLAG_GL1 | DMA1_FLAG_GL2);
    TIM_DMACmd(TIM8, TIM_DMA_Update, ENABLE);
    cycle_begin = ch585_cycle_now();
    DMA_Cmd(DMA1_Channel1, ENABLE);
    DMA_Cmd(DMA1_Channel2, ENABLE);
    TIM_Cmd(TIM8, ENABLE);

    timeout_cycles = (SystemCoreClock != 0U) ? (SystemCoreClock / 5U) : 80000000U;
    while (((DMA_GetFlagStatus(DMA1, DMA1_FLAG_TC1) == RESET) ||
            (DMA_GetFlagStatus(DMA1, DMA1_FLAG_TC2) == RESET)) &&
           ((uint32_t)(ch585_cycle_now() - cycle_begin) < timeout_cycles))
    {
    }

    cycle_delta = ch585_cycle_now() - cycle_begin;
    TIM_Cmd(TIM8, DISABLE);
    TIM_DMACmd(TIM8, TIM_DMA_Update, DISABLE);
    DMA_Cmd(DMA1_Channel1, DISABLE);
    DMA_Cmd(DMA1_Channel2, DISABLE);
    flags = DMA1->INTFR;
    GPIOD->BSHR = GPIO_BSHR_BR2;

    g_scan.source0_miso_idle[1] = (uint8_t)rt_pin_read(g_soft_spi.miso0);
    rt_pin_write(g_soft_spi.cs0, PIN_HIGH);
    ch585_soft_spi_delay();
    g_scan.source0_miso_idle[2] = (uint8_t)rt_pin_read(g_soft_spi.miso0);

    g_scan.source0_dma_runs++;
    if (((flags & DMA1_FLAG_TC1) == 0U) || ((flags & DMA1_FLAG_TC2) == 0U))
    {
        g_scan.source0_dma_timeouts++;
    }
    if ((flags & (DMA1_FLAG_TE1 | DMA1_FLAG_TE2)) != 0U)
    {
        g_scan.source0_dma_te_flags++;
    }

    bit_count = (uint32_t)APP_CH585_SPI_SOURCE0_CAPTURE_BYTES * 8U;
    g_scan.source0_xfer_cycles = cycle_delta;
    if (SystemCoreClock != 0U)
    {
        xfer_us = (uint32_t)((((uint64_t)cycle_delta * 1000000ULL) +
                              ((uint64_t)SystemCoreClock / 2ULL)) /
                             (uint64_t)SystemCoreClock);
        if (xfer_us == 0U)
        {
            xfer_us = 1U;
        }
        g_scan.source0_xfer_us = xfer_us;
        g_scan.source0_sck_khz_x10 = (uint32_t)(((uint64_t)bit_count * 10000ULL) /
                                                (uint64_t)xfer_us);
        g_scan.source0_frame_fps_x10 = (uint32_t)(10000000ULL / (uint64_t)xfer_us);
    }
    else
    {
        g_scan.source0_xfer_us = 0U;
        g_scan.source0_sck_khz_x10 = 0U;
        g_scan.source0_frame_fps_x10 = 0U;
    }

    ch585_dma_pack_source0_capture();
    g_scan.source0_backend = CH585_SPI_BACKEND_DMA_GPIO;
    return ch585_scan_decode_source0_capture(frame);
}
#endif

static int ch585_scan_fetch_real_or_fake(uint8_t source_id, ch585_scan_frame_v1_t *frame)
{
#if APP_CH585_SPI_REAL_SOURCE0
    if (source_id == 0U)
    {
#if APP_CH585_SPI_HW_SPI2_BACKEND
#if APP_CH585_SPI_REQUEST_ONLY_SHORT && APP_CH585_SPI_WIRE_SHORT
        if (ch585_scan_fetch_source0_hw_spi2_request_only(frame) == 0)
        {
            return 0;
        }
#elif APP_CH585_SPI_PIPELINE_SHORT && APP_CH585_SPI_WIRE_SHORT
        if (ch585_scan_fetch_source0_hw_spi2_pipeline(frame) == 0)
        {
            return 0;
        }
#else
        return ch585_scan_fetch_source0_hw_spi2(frame);
#endif
#endif
#if APP_CH585_SPI_DMA_BACKEND
        if (ch585_scan_fetch_source0_dma_spi(frame) == 0)
        {
            return 0;
        }
        return ch585_scan_fetch_source0_soft_spi(frame);
#else
        return ch585_scan_fetch_source0_soft_spi(frame);
#endif
    }
#endif

#if APP_CH585_SPI_FAKE_SOURCE1
    if (source_id == 1U)
    {
        return ch585_scan_fetch_source(source_id, frame);
    }
#endif

    return ch585_scan_fetch_source(source_id, frame);
}

static void ch585_scan_record_flags(ch585_scan_source_stats_t *stats, uint16_t flags)
{
    if ((flags & CH585_SCAN_FLAG_OVERRUN) != 0U)
    {
        stats->flag_overrun++;
    }
    if ((flags & CH585_SCAN_FLAG_ADC_ERROR) != 0U)
    {
        stats->flag_adc_error++;
    }
    if ((flags & CH585_SCAN_FLAG_STALE) != 0U)
    {
        stats->flag_stale++;
    }
    if ((flags & CH585_SCAN_FLAG_SYNC_LOST) != 0U)
    {
        stats->flag_sync_lost++;
    }
}

static void ch585_scan_mark_resync_if_source0(uint8_t source_id)
{
    if (source_id == 0U)
    {
        g_scan.source0_need_resync = 1U;
        g_scan.source0_pipeline_primed = 0U;
    }
}

static void ch585_scan_mark_resync_reason_if_source0(uint8_t source_id, uint8_t reason)
{
    if (source_id == 0U)
    {
        g_scan.source0_last_resync_reason = reason;
    }
    ch585_scan_mark_resync_if_source0(source_id);
}

#if APP_CH585_SPI_WIRE_SHORT
static void ch585_scan_store_source0_debug(const ch585_scan_frame_v1_t *frame)
{
    const ch585_scan_debug_short_t *debug = (const ch585_scan_debug_short_t *)frame;

    g_scan.source0_debug.frames++;
    g_scan.source0_debug.valid = 1U;
    g_scan.source0_debug.seq = debug->seq;
    g_scan.source0_debug.key_id = debug->key_id;
    g_scan.source0_debug.flags = debug->flags;
    g_scan.source0_debug.is_down =
        ((debug->flags & CH585_SCAN_SHORT_DEBUG_FLAG_DOWN) != 0U) ? 1U : 0U;
    g_scan.source0_debug.rt_armed =
        ((debug->flags & CH585_SCAN_SHORT_DEBUG_FLAG_RT_ARMED) != 0U) ? 1U : 0U;
    g_scan.source0_debug.raw_adc = debug->raw_adc;
    g_scan.source0_debug.filtered_adc = debug->filtered_adc;
    g_scan.source0_debug.position_pm = debug->position_pm;
    g_scan.source0_debug.peak_pm = debug->peak_pm;
}
#endif

static int ch585_scan_accept_frame(uint8_t expected_source, const ch585_scan_frame_v1_t *frame)
{
    ch585_scan_source_stats_t *stats;
    uint16_t expected_crc;
    uint16_t expected_base;
    uint16_t expected_seq;
    uint16_t frame_seq;
    uint16_t frame_flags;
    uint8_t i;
    uint8_t is_down;

    if ((expected_source >= CH585_SCAN_SOURCE_COUNT) || (frame == RT_NULL))
    {
        return -1;
    }

    stats = &g_scan.source[expected_source];

#if APP_CH585_SPI_WIRE_SHORT
    if (frame->magic != CH585_SCAN_SHORT_FRAME_MAGIC)
    {
        if (expected_source == 0U)
        {
            memcpy(g_scan.source0_bad_head, frame, sizeof(g_scan.source0_bad_head));
        }
        stats->magic_errors++;
        ch585_scan_mark_resync_reason_if_source0(expected_source, 1U);
        return -1;
    }

    if (ch585_scan_short_type_is_supported(frame->type) == 0)
    {
        stats->version_errors++;
        ch585_scan_mark_resync_reason_if_source0(expected_source, 2U);
        return -1;
    }

    expected_base = ch585_scan_expected_base(expected_source);
    if (frame->source_id != expected_source)
    {
        stats->source_errors++;
        ch585_scan_mark_resync_reason_if_source0(expected_source, 3U);
        return -1;
    }
#else
    if (frame->magic != CH585_SCAN_FRAME_MAGIC)
    {
        if (expected_source == 0U)
        {
            memcpy(g_scan.source0_bad_head, frame, sizeof(g_scan.source0_bad_head));
        }
        stats->magic_errors++;
        ch585_scan_mark_resync_reason_if_source0(expected_source, 1U);
        return -1;
    }

    if (frame->version != CH585_SCAN_FRAME_VERSION)
    {
        stats->version_errors++;
        ch585_scan_mark_resync_reason_if_source0(expected_source, 2U);
        return -1;
    }

    if (frame->type != CH585_SCAN_FRAME_TYPE_KEY_STATE)
    {
        stats->version_errors++;
        ch585_scan_mark_resync_reason_if_source0(expected_source, 2U);
        return -1;
    }

    expected_base = ch585_scan_expected_base(expected_source);
    if (frame->source_id != expected_source)
    {
        stats->source_errors++;
        ch585_scan_mark_resync_reason_if_source0(expected_source, 3U);
        return -1;
    }

    if (frame->key_count != CH585_SCAN_KEYS_PER_SOURCE)
    {
        stats->length_errors++;
        ch585_scan_mark_resync_reason_if_source0(expected_source, 4U);
        return -1;
    }
#endif

