lixc929/hardware/rtthread_port/applications/ch585_spi_scan.c
    expected_crc = ch585_spi_scan_crc16((const uint8_t *)frame,
                                        (uint16_t)offsetof(ch585_scan_frame_v1_t, crc16));
    if (frame->crc16 != expected_crc)
    {
        stats->crc_errors++;
        ch585_scan_mark_resync_reason_if_source0(expected_source, 5U);
        return -1;
    }

#if APP_CH585_SPI_WIRE_SHORT
    if ((frame->type == CH585_SCAN_SHORT_FRAME_TYPE_KEY_STATE) &&
        (expected_source == 0U) &&
        (frame->ack_seq != (uint8_t)g_scan.source0_accept_ack_seq))
    {
        g_scan.source0_ack_errors++;
        ch585_scan_mark_resync_reason_if_source0(expected_source, 6U);
        return -1;
    }

    frame_seq = frame->seq;
    if (expected_source == 0U)
    {
        g_scan.source0_last_frame_type = frame->type;
        g_scan.source0_last_frame_seq = frame->seq;
    }
    frame_flags = (frame->type == CH585_SCAN_SHORT_FRAME_TYPE_KEY_DEBUG) ?
                  ch585_scan_debug_flags_for_stats(frame->flags) :
                  ch585_scan_flags_from_short(frame->flags);
#else
    if ((expected_source == 0U) && (frame->ack_seq != g_scan.source0_accept_ack_seq))
    {
        g_scan.source0_ack_errors++;
        ch585_scan_mark_resync_reason_if_source0(expected_source, 6U);
        return -1;
    }

    frame_seq = frame->seq;
    frame_flags = frame->flags;
#endif

    if (stats->have_seq != 0U)
    {
#if APP_CH585_SPI_WIRE_SHORT
        expected_seq = (uint16_t)((stats->last_seq + 1U) & 0xFFU);
#else
        expected_seq = (uint16_t)(stats->last_seq + 1U);
#endif
        if (frame_seq != expected_seq)
        {
            stats->seq_drops++;
        }
    }

    stats->last_seq = frame_seq;
    stats->have_seq = 1U;
    stats->frames_ok++;
    ch585_scan_record_flags(stats, frame_flags);

#if APP_CH585_SPI_WIRE_SHORT
    if (frame->type == CH585_SCAN_SHORT_FRAME_TYPE_KEY_DEBUG)
    {
        if (expected_source == 0U)
        {
            ch585_scan_store_source0_debug(frame);
        }
        return 0;
    }

#if APP_CH585_SPI_SHORT_DIAG_IN_DOWN_BITS
    if (expected_source == 0U)
    {
        uint8_t diag = frame->down_bits[6];

        g_scan.source0_slave_diag_invalid_reason = frame->down_bits[0];
        g_scan.source0_slave_diag_invalid_count = frame->down_bits[1];
        g_scan.source0_slave_diag_raw_magic = frame->down_bits[2];
        g_scan.source0_slave_diag_raw_cmd = frame->down_bits[3];
        g_scan.source0_slave_diag_raw_host_seq = frame->down_bits[4];
        g_scan.source0_slave_diag_raw_ack_seq = frame->down_bits[5];
        g_scan.source0_slave_diag_rx_crc = 0U;
        g_scan.source0_slave_diag_expected_crc = 0U;
        g_scan.source0_slave_diag_cmd = (uint8_t)(diag & CH585_SHORT_DIAG_CMD_MASK);
        g_scan.source0_slave_diag_valid =
            ((diag & CH585_SHORT_DIAG_VALID_FLAG) != 0U) ? 1U : 0U;
        g_scan.source0_slave_diag_cmd_error =
            ((diag & CH585_SHORT_DIAG_CMD_ERROR_FLAG) != 0U) ? 1U : 0U;
        g_scan.source0_slave_diag_host_seq = frame->down_bits[7];
    }
#endif
#endif

    for (i = 0; i < CH585_SCAN_KEYS_PER_SOURCE; i++)
    {
#if APP_CH585_SPI_WIRE_SHORT && APP_CH585_SPI_SHORT_DIAG_IN_DOWN_BITS
        if (expected_source == 0U)
        {
            is_down = 0U;
        }
        else
#endif
        {
        is_down = (uint8_t)((frame->down_bits[i >> 3] >> (i & 7U)) & 1U);
        }
        g_scan.raw[expected_base + i] =
            (is_down != 0U) ? CH585_SCAN_PRESSED_ADC : CH585_SCAN_RELEASED_ADC;
    }

    return 0;
}

int ch585_spi_scan_init(void)
{
    memset(&g_scan, 0, sizeof(g_scan));
    memset(g_fake_seq, 0, sizeof(g_fake_seq));
    g_scan.source0_need_resync = 1U;
#if APP_CH585_SPI_REAL_SOURCE0
#if APP_CH585_SPI_HW_SPI2_BACKEND
    (void)ch585_hw_spi2_init();
#endif
    (void)ch585_soft_spi_init();
#if APP_CH585_SPI_DMA_BACKEND
    (void)ch585_dma_soft_spi_init();
#endif
    rt_kprintf("CH585 SPI scan ingest: source0=real preferred=%s fallback=%s, source1=%s\r\n",
#if APP_CH585_SPI_HW_SPI2_BACKEND
#if APP_CH585_SPI_HW_SPI2_GPIO_CS
               "hw-spi2-gpiocs",
#else
               "hw-spi2-hardnss",
#endif
#elif APP_CH585_SPI_DMA_BACKEND
               "dma-gpio",
#else
               "cpu-gpio",
#endif
#if APP_CH585_SPI_HW_SPI2_BACKEND && APP_CH585_SPI_DMA_BACKEND
               "dma-gpio/cpu-gpio",
#elif APP_CH585_SPI_HW_SPI2_BACKEND
               "cpu-gpio",
#elif APP_CH585_SPI_DMA_BACKEND
               "cpu-gpio",
#else
               "none",
#endif
#if APP_CH585_SPI_FAKE_SOURCE1
               "fake"
#else
               "disabled"
#endif
    );
#else
    rt_kprintf("CH585 SPI scan ingest: fake source backend enabled\r\n");
#endif
    rt_kprintf("CH585 SPI wire=%s cmd=%u bytes frame=%u bytes, sources=%u, keys/source=%u\r\n",
#if APP_CH585_SPI_WIRE_SHORT
               "short",
#else
               "legacy",
#endif
               (unsigned int)sizeof(ch585_scan_cmd_v1_t),
               (unsigned int)sizeof(ch585_scan_frame_v1_t),
               (unsigned int)CH585_SCAN_SOURCE_COUNT,
               (unsigned int)CH585_SCAN_KEYS_PER_SOURCE);
    return 0;
}

void ch585_spi_scan_poll_once(void)
{
    ch585_scan_frame_v1_t frame;
    uint8_t source_id;

    g_scan.poll_count++;

#if APP_CH585_SPI_AUTO_TRAIN && APP_CH585_SPI_HW_SPI2_BACKEND
    if ((g_scan.source0_train_done == 0U) &&
        (g_scan.poll_count >= APP_CH585_SPI_AUTO_TRAIN_AFTER_POLLS))
    {
        (void)ch585_hw_spi2_train();
    }
#endif

    for (source_id = 0; source_id < CH585_SCAN_SOURCE_COUNT; source_id++)
    {
        if (ch585_scan_fetch_real_or_fake(source_id, &frame) != 0)
        {
            g_scan.source[source_id].fetch_errors++;
            ch585_scan_mark_resync_if_source0(source_id);
            continue;
        }

        (void)ch585_scan_accept_frame(source_id, &frame);
    }
}

void ch585_spi_scan_dump_stats(void)
{
    uint8_t source_id;

    rt_kprintf("CH585 scan poll=%u raw[0]=%u raw[63]=%u raw[64]=%u raw[127]=%u\r\n",
               (unsigned int)g_scan.poll_count,
               (unsigned int)g_scan.raw[0],
               (unsigned int)g_scan.raw[63],
               (unsigned int)g_scan.raw[64],
               (unsigned int)g_scan.raw[127]);

    for (source_id = 0; source_id < CH585_SCAN_SOURCE_COUNT; source_id++)
    {
        const ch585_scan_source_stats_t *stats = &g_scan.source[source_id];
        rt_kprintf("  src%u ok=%u fetch=%u magic=%u ver=%u src=%u len=%u crc=%u seq_drop=%u flags[o/a/s/y]=%u/%u/%u/%u last_seq=%u\r\n",
                   (unsigned int)source_id,
                   (unsigned int)stats->frames_ok,
                   (unsigned int)stats->fetch_errors,
                   (unsigned int)stats->magic_errors,
                   (unsigned int)stats->version_errors,
                   (unsigned int)stats->source_errors,
                   (unsigned int)stats->length_errors,
                   (unsigned int)stats->crc_errors,
                   (unsigned int)stats->seq_drops,
                   (unsigned int)stats->flag_overrun,
                   (unsigned int)stats->flag_adc_error,
                   (unsigned int)stats->flag_stale,
                   (unsigned int)stats->flag_sync_lost,
                   (unsigned int)stats->last_seq);
    }

    if (g_scan.source0_debug.valid != 0U)
    {
        rt_kprintf("  src0 debug frames=%u seq=%u key=%u raw=%u filt=%u pos=%u peak=%u down=%u rt=%u\r\n",
                   (unsigned int)g_scan.source0_debug.frames,
                   (unsigned int)g_scan.source0_debug.seq,
                   (unsigned int)g_scan.source0_debug.key_id,
                   (unsigned int)g_scan.source0_debug.raw_adc,
                   (unsigned int)g_scan.source0_debug.filtered_adc,
                   (unsigned int)g_scan.source0_debug.position_pm,
                   (unsigned int)g_scan.source0_debug.peak_pm,
                   (unsigned int)g_scan.source0_debug.is_down,
                   (unsigned int)g_scan.source0_debug.rt_armed);
    }

