lixc929/hardware/rtthread_port/applications/ch585_spi_scan.c
    rt_kprintf("  src0 req_rx=%02x %02x %02x %02x cmdrx=%02x %02x %02x %02x head=%02x %02x %02x %02x %02x %02x %02x %02x bad=%02x %02x %02x %02x %02x %02x %02x %02x miso=%u/%u/%u sync=%u@%u.%u repair=%u\r\n",
               (unsigned int)g_scan.source0_req_rx[0],
               (unsigned int)g_scan.source0_req_rx[1],
               (unsigned int)g_scan.source0_req_rx[2],
               (unsigned int)g_scan.source0_req_rx[3],
               (unsigned int)g_scan.source0_cmd_rx[0],
               (unsigned int)g_scan.source0_cmd_rx[1],
               (unsigned int)g_scan.source0_cmd_rx[2],
               (unsigned int)g_scan.source0_cmd_rx[3],
               (unsigned int)g_scan.source0_head[0],
               (unsigned int)g_scan.source0_head[1],
               (unsigned int)g_scan.source0_head[2],
               (unsigned int)g_scan.source0_head[3],
               (unsigned int)g_scan.source0_head[4],
               (unsigned int)g_scan.source0_head[5],
               (unsigned int)g_scan.source0_head[6],
               (unsigned int)g_scan.source0_head[7],
               (unsigned int)g_scan.source0_bad_head[0],
               (unsigned int)g_scan.source0_bad_head[1],
               (unsigned int)g_scan.source0_bad_head[2],
               (unsigned int)g_scan.source0_bad_head[3],
               (unsigned int)g_scan.source0_bad_head[4],
               (unsigned int)g_scan.source0_bad_head[5],
               (unsigned int)g_scan.source0_bad_head[6],
               (unsigned int)g_scan.source0_bad_head[7],
               (unsigned int)g_scan.source0_miso_idle[0],
               (unsigned int)g_scan.source0_miso_idle[1],
               (unsigned int)g_scan.source0_miso_idle[2],
               (unsigned int)g_scan.source0_sync_found,
               (unsigned int)g_scan.source0_sync_byte,
               (unsigned int)g_scan.source0_sync_bit,
               (unsigned int)g_scan.source0_first_bit_repairs);
    rt_kprintf("  src0 tail=%02x %02x %02x %02x %02x %02x %02x %02x repair_crc rx=%04x exp=%04x miss=%u delay=%u setup_ms=%u cmd_wait_us=%u\r\n",
               (unsigned int)g_scan.source0_tail[0],
               (unsigned int)g_scan.source0_tail[1],
               (unsigned int)g_scan.source0_tail[2],
               (unsigned int)g_scan.source0_tail[3],
               (unsigned int)g_scan.source0_tail[4],
               (unsigned int)g_scan.source0_tail[5],
               (unsigned int)g_scan.source0_tail[6],
               (unsigned int)g_scan.source0_tail[7],
               (unsigned int)g_scan.source0_first_bit_repair_rx_crc,
               (unsigned int)g_scan.source0_first_bit_repair_expected_crc,
               (unsigned int)g_scan.source0_first_bit_repair_crc_misses,
               (unsigned int)APP_CH585_SPI_SOFT_DELAY_CYCLES,
               (unsigned int)APP_CH585_SPI_CS_SETUP_MS,
               (unsigned int)APP_CH585_SPI_CMD_TO_DATA_US);
    rt_kprintf("  src0 backend=%s hwspi2=%u prescaler=0x%04x hsrx=%u cpha=%u train_err=%u/%u resync=%u need_resync=%u cmd_q=%u cmd_sent=%u cmd_runs=%u cmd_timeout=%u ack_err=%u host_seq=%u spi2_runs=%u spi2_timeout=%u spi2_te=%u spi2_sr=%04x spi2_expect=%u.%u kHz dma_cfg=%u runs=%u timeout=%u te=%u target=%u kHz phase=%u period=%u sample_or=%04x sample_and=%04x\r\n",
               ch585_scan_source0_backend_name(),
#if APP_CH585_SPI_HW_SPI2_BACKEND
               1U,
#else
               0U,
#endif
               (unsigned int)g_scan.source0_spi2_prescaler,
               (unsigned int)g_scan.source0_spi2_hsrx,
               (unsigned int)g_scan.source0_spi2_cpha,
               (unsigned int)g_scan.source0_train_errors,
               (unsigned int)g_scan.source0_train_frames,
               (unsigned int)g_scan.source0_resync_runs,
               (unsigned int)g_scan.source0_need_resync,
               (unsigned int)g_scan.source0_cmd_queued,
               (unsigned int)g_scan.source0_cmd_sent,
               (unsigned int)g_scan.source0_cmd_runs,
               (unsigned int)g_scan.source0_cmd_timeouts,
               (unsigned int)g_scan.source0_ack_errors,
               (unsigned int)g_scan.source0_host_seq,
               (unsigned int)g_scan.source0_spi2_runs,
               (unsigned int)g_scan.source0_spi2_timeouts,
               (unsigned int)g_scan.source0_spi2_te_flags,
               (unsigned int)g_scan.source0_spi2_sr_last,
#if APP_CH585_SPI_HW_SPI2_BACKEND
               (unsigned int)(ch585_hw_spi2_expected_sck_khz_x10() / 10U),
               (unsigned int)(ch585_hw_spi2_expected_sck_khz_x10() % 10U),
#else
               0U,
               0U,
#endif
               (unsigned int)APP_CH585_SPI_DMA_BACKEND,
               (unsigned int)g_scan.source0_dma_runs,
               (unsigned int)g_scan.source0_dma_timeouts,
               (unsigned int)g_scan.source0_dma_te_flags,
               (unsigned int)APP_CH585_SPI_DMA_TARGET_KHZ,
               (unsigned int)CH585_SPI_DMA_PHASES_PER_BIT,
               (unsigned int)g_scan.source0_dma_period,
               (unsigned int)g_scan.source0_dma_sample_or,
               (unsigned int)g_scan.source0_dma_sample_and);
    if (g_scan.source0_train_candidate_count != 0U)
    {
        uint8_t i;

        rt_kprintf("  src0 train candidates:");
        for (i = 0U; i < g_scan.source0_train_candidate_count; i++)
        {
            rt_kprintf(" p%02x/h%u/c%u bad=%u seq=%u;",
                       (unsigned int)g_scan.source0_train_candidate_prescaler[i],
                       (unsigned int)g_scan.source0_train_candidate_hsrx[i],
                       (unsigned int)g_scan.source0_train_candidate_cpha[i],
                       (unsigned int)g_scan.source0_train_candidate_bad[i],
                       (unsigned int)g_scan.source0_train_candidate_seq[i]);
        }
        rt_kprintf("\r\n");
    }
    rt_kprintf("  src0 speed: %u bytes %u bits xfer=%u us cycles=%u sck=%u.%u kHz frame=%u.%u fps core=%u Hz hclk=%u Hz\r\n",
               (unsigned int)APP_CH585_SPI_SOURCE0_CAPTURE_BYTES,
               (unsigned int)(APP_CH585_SPI_SOURCE0_CAPTURE_BYTES * 8U),
               (unsigned int)g_scan.source0_xfer_us,
               (unsigned int)g_scan.source0_xfer_cycles,
               (unsigned int)(g_scan.source0_sck_khz_x10 / 10U),
               (unsigned int)(g_scan.source0_sck_khz_x10 % 10U),
               (unsigned int)(g_scan.source0_frame_fps_x10 / 10U),
               (unsigned int)(g_scan.source0_frame_fps_x10 % 10U),
               (unsigned int)SystemCoreClock,
               (unsigned int)HCLKClock);
}

const uint16_t *ch585_spi_scan_raw(void)
{
    return g_scan.raw;
}

const ch585_scan_source_stats_t *ch585_spi_scan_source_stats(uint8_t source_id)
{
    if (source_id >= CH585_SCAN_SOURCE_COUNT)
    {
        return RT_NULL;
    }

    return &g_scan.source[source_id];
}

int ch585_spi_scan_source0_debug_status(ch585_scan_debug_status_t *out)
{
    if (out == RT_NULL)
    {
        return -1;
    }

    memcpy(out, &g_scan.source0_debug, sizeof(*out));
    return (out->valid != 0U) ? 0 : -1;
}

uint32_t ch585_spi_scan_source0_sck_khz_x10(void)
{
    return g_scan.source0_sck_khz_x10;
}

uint16_t ch585_spi_scan_source0_prescaler(void)
{
    return g_scan.source0_spi2_prescaler;
}

uint8_t ch585_spi_scan_source0_hsrx(void)
{
    return g_scan.source0_spi2_hsrx;
}

