lixc929/hardware/rtthread_port/applications/ch585_spi_scan.c
uint8_t ch585_spi_scan_source0_cpha_edges(void)
{
    return (uint8_t)((g_scan.source0_spi2_cpha == SPI_CPHA_2Edge) ? 2U : 1U);
}

uint8_t ch585_spi_scan_source0_train_done(void)
{
    return g_scan.source0_train_done;
}

uint16_t ch585_spi_scan_source0_train_errors(void)
{
    return g_scan.source0_train_errors;
}

uint16_t ch585_spi_scan_source0_train_frames(void)
{
    return g_scan.source0_train_frames;
}

uint32_t ch585_spi_scan_source0_cmd_queued(void)
{
    return g_scan.source0_cmd_queued;
}

uint32_t ch585_spi_scan_source0_cmd_sent(void)
{
    return g_scan.source0_cmd_sent;
}

uint32_t ch585_spi_scan_source0_debug_cmd_sent(void)
{
    return g_scan.source0_debug_cmd_sent;
}

uint32_t ch585_spi_scan_source0_calibrate_cmd_sent(void)
{
    return g_scan.source0_calibrate_cmd_sent;
}

uint8_t ch585_spi_scan_source0_last_cmd(void)
{
    return g_scan.source0_last_cmd;
}

uint8_t ch585_spi_scan_source0_last_frame_type(void)
{
    return g_scan.source0_last_frame_type;
}

uint8_t ch585_spi_scan_source0_last_frame_seq(void)
{
    return g_scan.source0_last_frame_seq;
}

uint8_t ch585_spi_scan_source0_last_resync_reason(void)
{
    return g_scan.source0_last_resync_reason;
}

uint8_t ch585_spi_scan_source0_slave_diag_cmd(void)
{
    return g_scan.source0_slave_diag_cmd;
}

uint8_t ch585_spi_scan_source0_slave_diag_host_seq(void)
{
    return g_scan.source0_slave_diag_host_seq;
}

uint8_t ch585_spi_scan_source0_slave_diag_valid(void)
{
    return g_scan.source0_slave_diag_valid;
}

uint8_t ch585_spi_scan_source0_slave_diag_cmd_error(void)
{
    return g_scan.source0_slave_diag_cmd_error;
}

uint8_t ch585_spi_scan_source0_slave_diag_invalid_count(void)
{
    return g_scan.source0_slave_diag_invalid_count;
}

uint8_t ch585_spi_scan_source0_slave_diag_invalid_reason(void)
{
    return g_scan.source0_slave_diag_invalid_reason;
}

uint8_t ch585_spi_scan_source0_slave_diag_raw_magic(void)
{
    return g_scan.source0_slave_diag_raw_magic;
}

uint8_t ch585_spi_scan_source0_slave_diag_raw_cmd(void)
{
    return g_scan.source0_slave_diag_raw_cmd;
}

uint8_t ch585_spi_scan_source0_slave_diag_raw_host_seq(void)
{
    return g_scan.source0_slave_diag_raw_host_seq;
}

uint8_t ch585_spi_scan_source0_slave_diag_raw_ack_seq(void)
{
    return g_scan.source0_slave_diag_raw_ack_seq;
}

uint16_t ch585_spi_scan_source0_slave_diag_rx_crc(void)
{
    return g_scan.source0_slave_diag_rx_crc;
}

uint16_t ch585_spi_scan_source0_slave_diag_expected_crc(void)
{
    return g_scan.source0_slave_diag_expected_crc;
}

uint32_t ch585_spi_scan_source0_ack_errors(void)
{
    return g_scan.source0_ack_errors;
}

uint16_t ch585_spi_scan_source0_host_seq(void)
{
    return g_scan.source0_host_seq;
}

uint8_t ch585_spi_scan_source0_train_candidate_count(void)
{
    return g_scan.source0_train_candidate_count;
}

int ch585_spi_scan_source0_train_candidate(uint8_t index,
                                           uint16_t *prescaler,
                                           uint8_t *hsrx,
                                           uint8_t *cpha_edges,
                                           uint16_t *bad_errors,
                                           uint16_t *seq_errors)
{
    if ((index >= g_scan.source0_train_candidate_count) ||
        (prescaler == RT_NULL) ||
        (hsrx == RT_NULL) ||
        (cpha_edges == RT_NULL) ||
        (bad_errors == RT_NULL) ||
        (seq_errors == RT_NULL))
    {
        return -1;
    }

    *prescaler = g_scan.source0_train_candidate_prescaler[index];
    *hsrx = g_scan.source0_train_candidate_hsrx[index];
    *cpha_edges = g_scan.source0_train_candidate_cpha[index];
    *bad_errors = g_scan.source0_train_candidate_bad[index];
    *seq_errors = g_scan.source0_train_candidate_seq[index];
    return 0;
}
